{
  "PSKH1": {
    "uniprotid": "P11801",
    "gene_name": "PSKH1",
    "regulation": "The regulatory mechanisms of PSKH1 are multi-faceted. A unique characteristic of PSKH1 is its post-translational modification via dual fatty acylation. The myristoylation at glycine 2 is obligatory for subsequent palmitoylation at cysteines 6 and 8; these lipid modifications are critical for targeting PSKH1 to membrane compartments (berson1999identificationandcharacterization pages 4-5). In cellular expression systems, kinase assays have demonstrated that PSKH1 is capable of autophosphorylation primarily on threonine residues, and it also phosphorylates exogenous substrates such as PHAS-I. Furthermore, PSKH1’s regulation does not appear to involve a classical calmodulin-binding domain, although a stretch resembling a CaMKI calmodulin-binding motif is present in the N-terminal region, as noted in the detailed characterization reports (brede2000characterizationofpskh1 pages 3-6, shrestha2020cataloguingthedead pages 12-14). Taken together, these findings indicate that the regulatory state of PSKH1 is controlled by a combination of lipid-mediated membrane association and phosphorylation-dependent modulation of its catalytic activity."
  },
  "IRAK1": {
    "uniprotid": "P51617",
    "gene_name": "IRAK1",
    "regulation": "IRAK1 activity is tightly regulated by various post-translational modifications and protein–protein interaction events that ensure a controlled immune response. One of the primary modes of regulation is phosphorylation. Upon activation of TLRs or IL-1Rs, MyD88 is recruited to the receptor complex, and IRAK4 phosphorylates IRAK1 at specific threonine residues (for example, T209 and T387) within the kinase domain activation loop. This event is followed by IRAK1 autophosphorylation, which enhances its catalytic activity. These phosphorylation events also serve as triggers for subsequent modifications: once hyperphosphorylated, IRAK1 dissociates from the myddosome complex to interact with downstream signaling molecules such as TRAF6, Pellino proteins, and other components of the NF-κB activating cascade (gottipati2008irak1acritical pages 2-3, flannery2010theinterleukin1receptorassociated pages 43-47).\n\nIRAK1 is also subject to ubiquitination. Ubiquitin ligases such as Pellino are recruited following IRAK1 phosphorylation, leading to polyubiquitination of IRAK1 on lysine residues. The polyubiquitinated form of IRAK1 is then recognized by the ubiquitin-binding domain of NEMO (IKKγ), which helps bridge the complex with subsequent kinases including TAK1, ultimately resulting in the activation of the IKK complex and nuclear translocation of NF-κB. Concurrently, IRAK1 contains PEST sequences—regions rich in proline, glutamate, serine, and threonine—that serve as degradation signals. These sequences promote proteasomal degradation of IRAK1, thereby providing a negative feedback mechanism to curb prolonged signaling (flannery2010theinterleukin1receptorassociated pages 5-9, suzuki2005irakskeyregulatory pages 1-2).\n\nIn addition to phosphorylation and ubiquitination, IRAK1 undergoes sumoylation. The sumoylated form of IRAK1 is capable of translocating to the nucleus, where it has distinct functions including the phosphorylation of STAT3. Nuclear IRAK1 contributes to the transcriptional regulation of anti-inflammatory cytokines, such as interleukin-10, and is involved in promoting an antiviral state through the activation of interferon regulatory factors (singer2018inhibitionofinterleukin1 pages 1-2, li2005novelroleand pages 1-2).\n\nFurthermore, alternative splicing of IRAK1 mRNA leads to the generation of splice variants, such as IRAK1b, which, despite being kinase-inactive, retain the capacity to participate in signaling complexes and can modulate NF-κB activation. Such splice variants underscore the complex regulation of IRAK1 function by different mechanisms (gottipati2008irak1acritical pages 3-5, martin2001interleukin1receptorassociatedkinase1 pages 2-4)."
  },
  "IRAK2": {
    "uniprotid": "O43187",
    "gene_name": "IRAK2",
    "regulation": "The regulation of IRAK2 involves a multifaceted network of post‑translational modifications and protein–protein interactions that modulate its activity in response to IL‑1 receptor engagement. Following the binding of IL‑1 to its receptor, IRAK2 is recruited to the receptor complex through its death domain, where it becomes a part of the Myddosome along with MyD88 and IRAK4. An essential regulatory event is the phosphorylation of IRAK2; this modification, mediated by upstream kinases such as IRAK4, is critical for promoting conformational changes within IRAK2 that enable its proper function within the signaling complex (benosman2013interleukin1receptorassociatedkinase2 pages 1-3, gosu2012molecularevolutionand pages 14-15). The phosphorylation status of IRAK2 influences its ability to activate downstream effector kinases—including those responsible for triggering the NF‑κB pathway—and consequently controls the amplitude and duration of the inflammatory response.  \nIn addition to phosphorylation, alternative splicing of the IRAK2 mRNA results in the production of different isoforms that may have distinct regulatory properties and capacities to propagate signal transduction. Some splice variants are linked to enhanced pro‑inflammatory activity, while others can modulate processes such as endoplasmic reticulum stress‑induced apoptosis through their influence on transcription factors like CHOP (biswas2007myeloiddifferentiationfactor pages 4-5, smith2011irak2regulatesil1mediated pages 9-9). Furthermore, the incorporation of IRAK2 into the Myddosome via interactions mediated by its death domain ensures spatial and temporal control of its signaling function. Such regulated assembly is critical for enabling rapid responses to pathogen‑associated signals while preventing excessive or prolonged activation that might lead to pathological inflammation (benosman2013interleukin1receptorassociatedkinase2 pages 1-3, gosu2012molecularevolutionand pages 14-15)."
  },
  "IRAK3": {
    "uniprotid": "Q9Y616",
    "gene_name": "IRAK3",
    "regulation": "IRAK3 functions as a key negative regulator in the IL‑1R and TLR signaling cascades by modulating the assembly and disassembly of the receptor complex. Its primary regulatory mechanism involves inhibition of the dissociation of IRAK1 and IRAK4 from the MyD88 receptor complex, a process that normally leads to downstream activation of NF‑κB. By stabilizing this complex, IRAK3 prevents the necessary phosphorylation events on IRAK1 and IRAK4, thereby dampening the propagation of the pro‑inflammatory signal (flannery2010theinterleukin1receptorassociated pages 16-20, flannery2010theinterleukin1receptorassociated pages 20-24). In addition, studies indicate that IRAK3 can selectively inhibit the alternative NF‑κB pathway while allowing limited or altered activation of NF‑κB transcriptional programs; for instance, under certain conditions such as IL‑33–induced lung inflammation, IRAK3 positively regulates the expression of specific mRNAs, including IL6, CSF3, CXCL2, and CCL5 in dendritic cells (zho2013irak‐mmediatestoll‐like pages 1-2). Post‑translational modifications that typically regulate kinase activity, such as phosphorylation or ubiquitination, have not been delineated as major regulatory events for IRAK3; instead, its regulation is largely mediated by protein–protein interactions and conformational rearrangements, including dimerization that may be influenced by redox status through disulfide bridge formation (horne2021forwhomthe pages 2-2, su2009theinterleukin1receptorassociated pages 8-9, su2009theinterleukin1receptorassociated pages 9-10). Expression of IRAK3 is also tightly controlled, with inducible expression being predominantly restricted to monocytes, macrophages, and dendritic cells, which further underscores its specialized role in modulating innate immune responses (mahmoud2023modulationofirak pages 4-6, ringwood2008theinvolvementof pages 5-6)."
  },
  "IRAK4": {
    "uniprotid": "Q9NWZ3",
    "gene_name": "IRAK4",
    "regulation": "IRAK4 regulation occurs through multiple interconnected mechanisms. A key aspect of its regulation involves autophosphorylation; upon recruitment to receptor complexes via interactions with MyD88, IRAK4 dimerizes and undergoes trans‑autophosphorylation at critical residues located in its activation loop—particularly Thr345 and Ser346—which serve to relieve autoinhibition and generate an active kinase conformation (behairy2023unravelingextremelydamaging pages 19-21, wang2019conformationalflexibilityand pages 16-18). The death domain of IRAK4 also plays a regulatory role by mediating protein–protein interactions. This domain facilitates the assembly of the Myddosome, which is required for effective downstream signaling (dossang2016thenterminalloop pages 6-8). In addition, regulation of IRAK4 extends to its influence on other proteins; for example, IRAK4 phosphorylates Pellino family E3 ubiquitin ligases, which in turn catalyze the polyubiquitination of IRAK1. Such ubiquitination events are critical for the recruitment of downstream adaptor and effector proteins culminating in NF‑κB activation (behairy2023unravelingextremelydamaging pages 26-28). Although the detailed kinetics of substrate interaction have been explored, IRAK4 regulation is also modulated by its ability to cycle between inactive and active conformations, a process influenced by both autophosphorylation and binding of ATP or specific inhibitors (hekmatnejad2010steadystatekineticcharacterization pages 11-11, wang2009irak4inhibitorsfor pages 3-4). Each of these layers of regulation functions in a coordinated manner to ensure that IRAK4 activation is appropriately triggered in response to pathogen‑associated signals and is kept in check to prevent aberrant inflammation."
  },
  "TAOK1": {
    "uniprotid": "Q7L7X3",
    "gene_name": "TAOK1",
    "regulation": "TAOK1 regulation is achieved through multiple mechanisms that involve both autophosphorylation and interactions with regulatory proteins. Autophosphorylation events, notably at Thr440 and Thr443, play a pivotal role in controlling its plasma membrane binding and remodeling activity; phosphorylation at these sites can block membrane association, thus serving as an autoregulatory mechanism (beeman2023neurodevelopmentaldisorder–associatedmutations pages 25-26, byeon2024pleiotropicfunctionsof pages 7-9). Phosphorylation of Ser181 within the catalytic loop is also critical to achieving full kinase activity (beeman2023neurodevelopmentaldisorder–associatedmutations pages 3-4). Additionally, TAOK1 is subject to regulation by upstream signals; for example, it operates downstream of G-protein coupled receptor signaling to activate the p38/MAPK cascade during responses to DNA damage, linking its activation to cell cycle checkpoint control at the G2/M transition (beeman2023neurodevelopmentaldisorder–associatedmutations pages 6-7, hu2021clinicalandneurobiological pages 3-4). Modulatory phosphorylation by other kinases, such as MST3, has also been implicated in regulating TAOK1’s function in neuronal development (byeon2024pleiotropicfunctionsof pages 16-18)."
  },
  "CHEK2": {
    "uniprotid": "O96017",
    "gene_name": "CHEK2",
    "regulation": "The regulation of Chk2 is multifaceted and is predominantly controlled by phosphorylation events. In response to DNA double-strand breaks, ATM kinase phosphorylates Chk2 at threonine 68 (T68), an event that promotes homodimerization through interactions mediated by the FHA and SCD domains. This initial phosphorylation event is essential for subsequent autophosphorylations at residues such as T383, T387 in the activation loop and at serine 516, all of which are required for full activation of the kinase. In addition to phosphorylation, Chk2 regulation can involve ubiquitination—the process through which its stability is modulated—and dephosphorylation by specific phosphatases such as PP2A and WIP1, which act to return Chk2 to its basal inactive state once DNA repair is accomplished. Moreover, post-translational modifications may influence subcellular localization, as interactions with proteins such as karyopherin-alpha have been implicated in the nuclear import of Chk2. Such regulation ensures that Chk2 functions in a precise and timely manner to control cell cycle arrest, DNA repair, and apoptosis (li2005regulationofchk2 pages 1-2, wu2006characterizationofchek2 pages 3-4, stolarova2020chek2germlinevariants pages 30-31)."
  },
  "RIPK2": {
    "uniprotid": "O43353",
    "gene_name": "RIPK2",
    "regulation": "RIPK2 is regulated by a series of post-translational modifications that modulate its stability and activity. Following its recruitment by NOD1 and NOD2, RIPK2 undergoes autophosphorylation in the activation segment, which, while not strictly required for the propagation of downstream NF-κB signaling, contributes to its proper conformational stability (pellegrini2017structuresofthe pages 1-2). In addition to phosphorylation events, RIPK2 is subject to Lys63-linked polyubiquitination mediated by E3 ubiquitin ligases such as XIAP, BIRC2, and BIRC3, as well as linear (Met1-linked) polyubiquitination by the LUBAC complex. These ubiquitin modifications transform RIPK2 into a scaffolding protein that recruits key downstream effectors, including IKBKG/NEMO, thereby facilitating the activation of the canonical NF-κB pathway (dardick2006plantandanimal pages 13-14, pellegrini2017structuresofthe pages 25-26). Structurally, the kinase domain interacts with the BIR2 domain of XIAP across the dimer interface, an interaction that is essential for subsequent polyubiquitination events (lethier2022structuralanalysisshows pages 1-4). Through these post-translational modifications, RIPK2 is tightly regulated in both its activation and its ability to serve as a signal-transducing hub in innate immune responses."
  },
  "RIPK4": {
    "uniprotid": "P57078",
    "gene_name": "RIPK4",
    "regulation": "RIPK4’s activity is modulated by a variety of post-translational modifications and protein–protein interactions. Autophosphorylation within its kinase domain is a key regulatory event, and analyses of its activation have shown that dimerization is essential for full kinase activity (chirieleison2016syntheticbiologyreveals pages 6-7, cuny2021ripkproteinkinase pages 8-8). Ubiquitin-mediated regulation also plays a significant role; RIPK4 is targeted for ubiquitination by the SCFβ-TrCP E3 ubiquitin ligase complex, with specific phosphodegron motifs (particularly in the region encompassing serines 379, 382, and 383) being crucial for this interaction. Mutation of these serine residues disrupts the binding to β-TrCP and alters protein stability, thereby affecting downstream signaling events and maintaining the organization of the cortical actin cytoskeleton in keratinocytes (tanghe2018ripk4activityin pages 6-7). Additionally, RIPK4 is subject to proteolytic cleavage by caspase-8 under pro-apoptotic conditions, a modification that impairs its anti-apoptotic NF-κB activating function and thereby shifts the cellular balance toward programmed cell death (torre2021theroleof pages 5-6). These multiple layers of regulation ensure that RIPK4 activity is tightly controlled during epidermal differentiation and stress responses (fransen2011exploringtherolea pages 117-122)."
  },
  "JAK1": {
    "uniprotid": "P23458",
    "gene_name": "JAK1",
    "regulation": "The regulatory mechanisms controlling JAK1 involve multiple layers of control. Post-translational modifications, especially phosphorylation events, play a central role in modulating JAK1 activity. Phosphorylation of conserved tyrosine residues in the activation loop of the kinase domain (for example, Y1038 and Y1039, as noted in the provided protein function information) is critical for full catalytic activation. These phosphorylation events induce conformational changes that align the catalytic residues for efficient phosphoryl transfer (zhong2012tslpsignalingnetwork pages 30-36, raivolaUnknownyearmolecularregulationof pages 60-64).\n\nIn addition to activation loop phosphorylation, the pseudokinase domain (JH2) exerts an autoinhibitory effect on the kinase domain. Mutations in the JH2 domain have been shown to either enhance or diminish kinase activity, indicating that this module fine-tunes signal output in response to cytokine binding (raivolaUnknownyearmolecularregulationof pages 30-33, kwon2019tracingtheevolution pages 170-171). Regulatory proteins such as SOCS1, which binds directly to JAK1 via its kinase inhibitory region and SH2 domain, further attenuate JAK signaling by competing with substrates and promoting degradation of activated kinases (liau2018themolecularbasis pages 2-3).\n\nFurthermore, receptor engagement is a critical regulatory input for JAK1 activation. Upon cytokine binding to receptor heterodimers such as IFNAR1–IFNAR2 or the IL-2 receptor complex, conformational rearrangements bring together the receptor-associated JAK kinases, facilitating transphosphorylation and activation (corey1999srcrelatedproteintyrosine pages 1-2, lv2024thejakstatpathway pages 12-15). The dynamic interplay between receptor binding, pseudokinase-mediated autoinhibition, and activation loop phosphorylation defines the tightly regulated homeostasis required for appropriate cytokine signaling. In addition, feedback mechanisms involving phosphatases, such as SHP1 and SHP2, modulate the phosphorylation status of JAK1 and its substrates, ensuring signal termination and preventing excessive activation (guye2006proteinsinjectedby pages 10-14)."
  },
  "JAK2": {
    "uniprotid": "O60674",
    "gene_name": "JAK2",
    "regulation": "JAK2 is regulated through a combination of post-translational modifications and intramolecular domain interactions that ensure its activity is tightly controlled under basal conditions. A key regulatory mechanism involves the autophosphorylation of tyrosine residues within the activation loop of the kinase domain (JH1). In particular, phosphorylation of tyrosine 1007 is critical for releasing autoinhibitory constraints and stabilizing the active conformation of JAK2, thereby facilitating efficient substrate phosphorylation (babon2014themolecularregulation pages 1-3, matsuda2004determinationofthe pages 6-11).\n\nThe pseudokinase domain (JH2) plays a central regulatory role by exerting a negative influence on the catalytic activity of the JH1 domain. Under resting conditions, the JH2 domain interacts with JH1 to maintain a low basal level of kinase activity. This autoinhibitory interaction is mediated via an intricate network of contact interfaces involving the SH2–JH2 linker region that modulates ATP binding. Disruption of these interactions, as observed in the commonly occurring V617F mutation within the JH2 domain, can lead to loss of autoinhibition and constitutive activation of JAK2. Such dysregulation is associated with several myeloproliferative disorders (hubbard2018mechanisticinsightsinto pages 5-6, barua2009abipolarclamp pages 7-8).\n\nAdditional layers of regulation are provided by other post-translational modifications. Phosphorylation events on residues outside the activation loop also contribute to fine-tuning JAK2 activity. For example, phosphorylation of specific tyrosines within domains involved in receptor docking can modulate the stability of the receptor–JAK2 complex, thereby indirectly influencing downstream signaling events. Regulatory mechanisms also include ubiquitination and dephosphorylation, which serve to modulate the turnover and deactivation of JAK2 under various physiological conditions. Collectively, these regulatory strategies ensure that JAK2 remains tightly controlled until receptor engagement triggers the necessary conformational changes for full enzymatic activation (babon2014themolecularregulation pages 1-3, mingione2023allostericregulationand pages 7-9, matsuda2004determinationofthe pages 1-6)."
  },
  "JAK3": {
    "uniprotid": "P52333",
    "gene_name": "JAK3",
    "regulation": "JAK3 regulatory mechanisms involve a combination of intramolecular interactions, post-translational modifications, and extrinsic regulatory proteins. Autophosphorylation of key tyrosine residues within the activation loop (notably Y980 and Y981) is critical for full enzymatic activation, and differential phosphorylation of these sites modulates catalytic output (oshea2009januskinasesin pages 15-16, smith2016essentialbiphasicrole pages 5-6). In addition to autophosphorylation, the pseudokinase domain (JH2) exerts an inhibitory effect on basal kinase activity, ensuring that JAK3 remains inactive in the absence of receptor stimulation (vihinen2000molecularmodelingof pages 5-7, ungureanu2005posttranslationalmodificationsin pages 11-14). Regulatory proteins such as SOCS family members further modulate JAK3 activity by binding to the receptor–kinase complex and promoting ubiquitination and subsequent proteasomal degradation (rane2000januskinasescomponents pages 12-13, oshea2009januskinasesin pages 13-15). In addition, protein tyrosine phosphatases like SHP-1 and CD45 dephosphorylate active JAK3, providing a negative feedback loop that limits the duration of signaling (oshea2009januskinasesin pages 16-17, rane2000januskinasescomponents pages 13-14)."
  },
  "TYK2": {
    "uniprotid": "P29597",
    "gene_name": "TYK2",
    "regulation": "The regulation of TYK2 is governed by a series of phosphorylation events and conformational changes that modulate its enzymatic activity. Under resting conditions, the pseudokinase (JH2) domain exerts an autoinhibitory effect on the adjacent kinase domain (JH1) by stabilizing an inactive conformation. Critical phosphorylation events occur within the activation loop of the kinase domain; the phosphorylation of these tyrosine residues results in a reorientation of the activation loop along with the repositioning of the C‑helix, thereby aligning the catalytic residues to facilitate efficient substrate phosphorylation (niranjan2014functionalcharacterizationof pages 38-41, wang2025atripleactioninhibitory pages 17-21).  \nIn addition to autophosphorylation, TYK2 activity is further regulated by trans‑phosphorylation events mediated by associated kinases within the cytokine receptor complexes. For example, following cytokine binding to its receptor, TYK2 phosphorylates receptor subunits which in turn serve as recruitment platforms for STAT transcription factors. Once docked, the STAT proteins can be phosphorylated either by TYK2 directly or in tandem with its partnering kinases such as JAK1 or JAK2 (borcherding2021tyk2incancer pages 8-10, creeden2020kinomearrayprofiling pages 18-22).  \nBeyond these phosphorylation events, post‑translational modifications at secondary regulatory sites also contribute to the modulation of TYK2’s activity. One notable regulatory mechanism involves the selective phosphorylation of STAT3 by TYK2 at a tyrosine residue that is distinct from the canonical activation site, resulting in a unique inhibitory effect on STAT3 function (eshaq2024nonreceptortyrosinekinases pages 33-34, nor sohn2013arestrictedrole pages 2-3). Thus, the activation state of TYK2 is determined by a delicate balance of phosphorylation-induced conformational changes, relief of pseudokinase-mediated autoinhibition, and additional protein–protein interactions within the receptor complexes (niranjan2014functionalcharacterizationofa pages 27-30, wang2025atripleactioninhibitory pages 21-24)."
  },
  "TRPM7": {
    "uniprotid": "Q96QT4",
    "gene_name": "TRPM7",
    "regulation": "TRPM7 is under complex regulation that integrates its roles in ion conductance and kinase signaling. The channel portion is inhibited by intracellular Mg²⁺ and Mg·ATP, providing a feedback mechanism that links the metabolic state of the cell with ion flux (chubanov2012theemergingrole pages 134-137). In addition, phosphatidylinositol 4,5-bisphosphate (PIP₂) interactions are critical for channel gating; depletion of PIP₂, as can occur following phospholipase C activation, diminishes channel activity. Autophosphorylation of the kinase domain also regulates its catalytic function and may influence the coupling between the channel and kinase activities. Moreover, proteolytic cleavage of the kinase domain has been reported, with the cleaved fragment translocating to the nucleus to participate in additional signaling events. These post-translational modifications underscore the multifaceted regulatory mechanisms governing TRPM7 function and ensure tight control over its dual activity (chubanov2012theemergingrole pages 139-141, clapham2001thetrpion pages 7-8)."
  },
  "TLK1": {
    "uniprotid": "Q9UKI8",
    "gene_name": "TLK1",
    "regulation": "TLK1 activity is tightly controlled by cell cycle cues and DNA damage signals. Under normal S-phase conditions, TLK1 is active, promoting chromatin assembly by phosphorylating histone chaperones and other substrates. However, upon induction of DNA double-strand breaks, TLK1 is rapidly and transiently inhibited through phosphorylation. This DNA damage–induced inhibition is mediated via checkpoint signaling pathways, in particular through ATM-dependent activation of Chk1, which phosphorylates TLK1 at specific residues—such as serine 695—leading to a reduction of its kinase activity (benedetti2012thetousledlikekinases pages 6-7, sunavala‐dossabhoy2018preservingsalivarygland pages 12-16). In addition to DNA damage–dependent modulation, translational regulation via upstream open reading frames (uORFs) in the 5′-UTR of TLK1B, an important splice variant, also influences TLK1 protein levels. Post-translational modifications, including autophosphorylation events, are essential for maintaining proper activity and regulating protein–protein interactions with substrates such as ASF1 and Rad9 (ghosh2023untouslingtherole pages 2-4, benedetti2012thetousledlikekinases pages 6-7)."
  },
  "TLK2": {
    "uniprotid": "Q86UE8",
    "gene_name": "TLK2",
    "regulation": "Regulation of TLK2 activity is complex and involves multiple mechanisms. Autophosphorylation is a major regulatory mechanism by which TLK2 modulates its own activity. This process can occur in both cis (within the same monomer) and trans (between monomers in a dimer) fashions, resulting in sequential phosphorylation events that stabilize the active conformation of the enzyme (mortuza2018molecularbasisof pages 2-3, pages 3-4). Specifically, phosphorylation of residues within the kinase domain (e.g., S617, S686, and T695) is essential for achieving full catalytic activity, while additional phosphorylation events in the C-terminal tail can also influence oligomer assembly and provide feedback regulation (mortuza2018molecularbasisof pages 9-10). Furthermore, TLK2 activity is modulated by the cellular state; for example, checkpoint kinase CHK1 phosphorylates related TLK1 in response to DNA damage, and similar regulatory mechanisms are posited for TLK2, linking its kinase activity with DNA replication and repair responses (sillje1999mammalianhomologuesof pages 11-12, bhoir2018highyieldbacterial pages 6-8)."
  },
  "LIMK1": {
    "uniprotid": "P53667",
    "gene_name": "LIMK1",
    "regulation": "Regulation of LIMK1 occurs through several mechanisms that ensure its activity is finely tuned according to cellular demands. A primary regulatory mechanism involves phosphorylation of the kinase domain’s activation loop, specifically at threonine-508. This phosphorylation is carried out by upstream kinases such as Rho-associated kinase (ROCK1) and p21-activated kinases (PAK1 and PAK4), which themselves are activated downstream of Rho family GTPases. The phosphorylation at threonine-508 is essential for the full activation of LIMK1, as it induces conformational changes that align critical catalytic residues and facilitate substrate binding (mittelstaedt2012structuralandfunctional pages 53-56).  \nIn addition to phosphorylation-mediated activation, LIMK1 activity is modulated by its interactions with various regulatory proteins. For example, the chaperone protein Hsp90 has been shown to promote homodimerization of LIMK1, a process that not only stabilizes the active conformation of the kinase but also increases its half-life in the cell, extending from approximately 4 to 20 hours (mittelstaedt2012structuralandfunctional pages 53-56). Conversely, the phosphatase slingshot (SSH) serves as a negative regulator by dephosphorylating both LIMK1 and its substrate cofilin. This dephosphorylation reaction reverses the inhibition of cofilin, thereby restoring its actin-depolymerizing activity and contributing to the dynamic regulation of actin filament turnover (mittelstaedt2012structuralandfunctional pages 53-56).  \nAn additional layer of regulation is provided through alternative splicing of the LIMK1 transcript, which generates isoforms with distinct functional properties. One such isoform, known as LIMK1-short, lacks a portion of the kinase domain necessary for catalytic activity and functions in a dominant-negative manner, thereby modulating overall LIMK1 activity within the cell (mittelstaedt2012structuralandfunctional pages 38-46). This isoform diversity contributes to the precise spatial and temporal regulation of actin dynamics, ensuring that LIMK1 activity can be tailored to specific cellular contexts such as neuronal development or cell migration."
  },
  "LIMK2": {
    "uniprotid": "P53671",
    "gene_name": "LIMK2",
    "regulation": "LIMK2 activity is tightly regulated by multiple mechanisms that ensure spatial and temporal control of actin cytoskeleton remodeling. One critical mechanism is phosphorylation of the activation loop; most notably, phosphorylation at threonine 505 by upstream kinases such as ROCK (Rho-associated protein kinase), p21-activated kinases (PAKs), and MRCKα serves to enhance LIMK2 kinase activity (brion2021limkinasesin pages 2-4, chatterjee2022structuralaspectsof pages 11-12). In addition, Aurora-A kinase has been identified as an activator of LIMK2, capable of phosphorylating multiple serine and threonine residues, which further modulate its activity (rak2014novellimk2inhibitor pages 1-2).  \nAutoinhibitory interactions also play a role in regulating kinase activity; the N-terminal LIM domains and the adjacent PDZ domain form intramolecular contacts that can restrain kinase activity until appropriate upstream signals trigger a conformational change (goyal2005dualfunctionof pages 24-28, ribba2022theroleof pages 12-13). Furthermore, stabilization and proper dimerization—a process promoted by interaction with molecular chaperones such as Hsp90—are essential for full kinase activation; inhibition of Hsp90 leads to decreased LIMK2 levels and consequent reduction in cofilin phosphorylation (chatterjee2022structuralaspectsof pages 1-3, manetti2012limkinasesare pages 3-6). Additional layers of regulation are provided by phosphatases, including PP1 and PP2A, which can dephosphorylate both LIMK2 and its substrates to restore basal actin dynamics (brion2021limkinasesin pages 2-4)."
  },
  "ETK": {
    "uniprotid": "P38134",
    "gene_name": "ETK",
    "regulation": "The regulation of Etk activity is attained through reversible phosphorylation events that serve as molecular switches for activation and inactivation. Autophosphorylation on its C‐terminal tyrosine cluster is required for full kinase activity, and this modification modulates the assembly state of Etk, with fully phosphorylated forms favoring a monomeric or lower‐order oligomeric state conducive to catalytic function. Specifically, phosphorylation of the regulatory Y574 relieves autoinhibition by promoting a conformational rearrangement that permits substrate access to the active site (lee2008structureofescherichia pages 6-7, hansen2013theescherichiacoli pages 10-11). The kinase is also subject to dephosphorylation by a dedicated phosphotyrosine phosphatase, which resets its phosphorylation state and modulates its enzymatic output. These post‐translational modifications ensure that Etk activity is tightly controlled in response to intracellular signals, thereby regulating downstream processes including capsule formation and virulence factor production (hansen2013theescherichiacoli pages 12-13, hansen2013theescherichiacoli pages 9-10)."
  },
  "BTK": {
    "uniprotid": "Q06187",
    "gene_name": "BTK",
    "regulation": "The activity of BTK is tightly regulated by numerous mechanisms, predominantly through phosphorylation events and protein-protein interactions. Phosphorylation of Y551 in the kinase domain—catalyzed by upstream kinases such as SYK or members of the Src family (e.g., LYN)—induces a conformational change that markedly increases BTK’s catalytic activity (buggy2012brutontyrosinekinase pages 3-4). Following this event, BTK undergoes autophosphorylation at Y223 within its SH3 domain, which further stabilizes its active conformation and promotes propagation of downstream signaling via substrates like PLCγ2 (singh2018roleofbruton’s pages 2-4, wen2021inhibitorstargetingbruton’s pages 1-2). In addition to phosphorylation, BTK functions as a scaffold protein that nucleates various multiprotein complexes involved in B-cell and Toll-like receptor signaling; for instance, it induces tyrosine phosphorylation of the TIR domain-containing adaptor protein (TIRAP), thereby triggering its degradation and fine-tuning TLR9-mediated signaling (buggy2012brutontyrosinekinase pages 9-11). Moreover, BTK is implicated in the activation of the NLRP3 inflammasome through phosphorylation of NLRP3, a process that is central to the regulation of innate immune responses (mcdonald2021theroleof pages 22-25). Together, these regulatory events coordinate the spatiotemporal activity of BTK, ensuring that it is activated in response to appropriate antigen receptor engagement and modulated during stress and inflammatory conditions (crofford2016theroleof pages 9-10, hendriks2014targetingbrutonstyrosine pages 11-12)."
  },
  "ITK": {
    "uniprotid": "Q08881",
    "gene_name": "ITK",
    "regulation": "ITK activity is governed by a series of regulatory mechanisms that ensure its activity is tightly coupled to T‑cell receptor (TCR) engagement. In resting T cells, intramolecular interactions among the PH, TH, SH3, and SH2 domains maintain ITK in an autoinhibited, closed conformation. Upon TCR stimulation, activation of PI3 kinase results in the generation of PIP₃ at the plasma membrane, allowing the PH domain of ITK to bind these lipids and drive its translocation to the membrane where its substrates are located (hsu2023selectiveinhibitionof pages 3-5, zhong2014targetinginterleukin2inducibletcell pages 11-13).  \nThe next critical step in ITK activation is mediated by LCK, a Src family kinase that phosphorylates the activation loop tyrosine (Y511) within the kinase domain. This phosphorylation event relieves autoinhibitory contacts and primes ITK for full catalytic activity. Subsequent autophosphorylation on additional sites, such as tyrosine 180 in the SH3 domain, further enhances ITK’s enzymatic activity and its ability to engage with adaptor proteins (devkota2017anautoinhibitoryrole pages 3-4, kannan2015requirementforitk pages 9-11, hsu2023selectiveinhibitionof pages 16-20).  \nMoreover, allosteric regulation is achieved through conformational shifts that are induced upon ligand binding and intramolecular domain rearrangement. The interplay between the PH domain and the catalytic domain, together with the disruption of autoinhibitory interactions mediated by the SH3 and proline‑rich regions, facilitates the transition of ITK from a closed, inactive state to an open, active conformation (devkota2017anautoinhibitoryrole pages 22-23, hsu2023selectiveinhibitionof pages 16-20)."
  },
  "TEC": {
    "uniprotid": "P42680",
    "gene_name": "TEC",
    "regulation": "TEC activity is subject to multilayered regulation that operates at both the biochemical and conformational levels. One of the primary regulatory features is autoinhibition, which is mediated by the N-terminal PH domain directly interacting with the kinase domain. This interaction masks essential catalytic and substrate-docking sites, thus preventing premature activation. Engagement of the PH domain with PIP3 relieves this autoinhibition by prompting a conformational rearrangement that promotes membrane localization and subsequent activation of the kinase (amatya2019lipidtargetingpleckstrinhomology pages 5-6).  \nIn addition to relief from autoinhibition, TEC’s activity is modulated by phosphorylation events. The activation loop within the kinase domain contains a critical tyrosine residue whose phosphorylation is essential for full catalytic activity; this phosphorylation can be mediated by Src family kinases as well as by autophosphorylation (joseph2010identificationofan pages 6-8, miller2002newinsightsinto pages 7-8). Phosphorylation within the SH3 domain has also been documented in related Tec kinases, which affects the ability of the SH3 domain to engage with proline-rich motifs and consequently influences downstream signaling dynamics (nore2003identificationofphosphorylation pages 1-2, bradshaw2010thesrcsyk pages 7-9). Furthermore, allosteric regulation through shifts in the hydrophobic spine and repositioning of the C-helix contributes to fine-tuning TEC’s enzymatic activity. These collective regulatory mechanisms ensure that TEC activity is tightly restricted to conditions where receptor-mediated PI3K activation generates the appropriate lipid signals, thereby maintaining fidelity in immune and other signaling pathways (bradshaw2010thesrcsyk pages 5-6, joseph2010identificationofan pages 6-8)."
  },
  "TXK": {
    "uniprotid": "P42681",
    "gene_name": "TXK",
    "regulation": "TXK is regulated by several interlinked mechanisms that ensure its kinase activity is tightly coupled to immune receptor engagement. One major regulatory mechanism is phosphorylation. Upon activation of antigen presenting cells (APCs) and subsequent engagement of the T‑cell receptor, TXK is recruited to the plasma membrane where it undergoes phosphorylation at Tyr‑420, a modification that is essential for full activation of its kinase domain (mamand2018characterisinginterleukin2induciblekinase pages 211-214). In addition to phosphorylation, TXK function is modulated by docking interactions that involve non‑canonical binding interfaces. Studies on related Tec kinases have shown that substrate docking can occur through interactions between the SH2 domain of the substrate and complementary charged surfaces on the kinase domain; such interactions enhance phosphorylation efficiency, even when the local sequence motifs are not optimal (min2008interleukin2tyrosinekinasesubstrate pages 35-39, min2008interleukin2tyrosinekinasesubstrate pages 73-78). Furthermore, conformational regulation is a key element in TXK activation. The assembly of the hydrophobic regulatory spine within the kinase domain—stabilized through intramolecular contacts involving the SH2 and kinase domains—ensures that TXK remains catalytically competent only when appropriate upstream signals are present. This allosteric control mechanism has been supported by structural analyses of Tec kinases and is critical for preventing aberrant activation (joseph2010identificationofan pages 6-8)."
  },
  "FRK": {
    "uniprotid": "P42685",
    "gene_name": "FRK",
    "regulation": "The regulatory mechanisms governing FRK activity are multifaceted, relying on both intramolecular domain interactions and post-translational modifications that fine-tune its catalytic output. A central mechanism of regulation involves autophosphorylation: phosphorylation at Tyr387 located within the activation loop of the kinase domain increases FRK’s enzymatic activity by promoting a conformational change that aligns catalytic residues for efficient phosphoryl transfer. Conversely, phosphorylation at Tyr497 in the C-terminal tail functions as an inhibitory modification. This phosphorylation event creates a docking site for the SH2 domain of FRK itself, thereby fostering an intramolecular interaction that shifts the protein into an autoinhibited conformation. In addition to these phosphorylation events, the SH2 domain’s inherent ability to bind phosphotyrosine-containing motifs of partner proteins also plays a role in modulating FRK signaling output by influencing substrate recruitment and subcellular localization. Notably, the presence of a nuclear localization signal within the SH2 domain further complicates the regulatory landscape by enabling a dynamic distribution between cytosolic and nuclear compartments based on its phosphorylation status and interacting partners. These allosteric and conformational regulatory mechanisms underscore the precision with which FRK activity is controlled, ensuring that its kinase function is appropriately modulated in response to various extracellular and intracellular signals (Byeon2012theroleof pages 2-3, McClendon2020structurefunctionand pages 11-13, Martellucci2020srcfamilykinases pages 2-4)."
  },
  "FGR": {
    "uniprotid": "P09769",
    "gene_name": "FGR",
    "regulation": "Fgr is subjected to a variety of regulatory mechanisms that modulate its kinase activity. Autophosphorylation events within the kinase domain are a central part of activation, while phosphorylation of a conserved C-terminal tyrosine residue by C-terminal Src kinase (Csk) mediates negative regulation by promoting an inactive conformation through intramolecular SH2 domain binding (ruzzene1994regulationofcfgr pages 1-2, kemble2009abiochemicalstudy pages 155-159). In addition, gain-of-function mutations, such as the p.Asp502Gly substitution identified in both murine models and human patients afflicted with autoinflammatory bone disease, alter the regulatory phosphorylation dynamics and disrupt the balance of kinase signaling (abe2019gainoffunctionmutationsin pages 1-1, abe2019gainoffunctionmutationsin pages 2-3). Fgr is also modulated through interactions with adaptor proteins and through its association with cell-surface receptors, such as Fc receptors, where receptor crosslinking triggers enhanced autophosphorylation and catalytic activity (toyoshima1993associationofimmunoglobulin pages 1-2, toyoshima1993associationofimmunoglobulin pages 4-5). Moreover, studies in monocytes have shown that Fgr can interact with Syk kinase via its SH2 domain, leading to inhibition of Syk-dependent signaling pathways in β2 integrin receptor signaling (vines2001inhibitionofβ2 pages 13-13, vines2001inhibitionofβ2 pages 6-7). Collectively, these modifications—mediated by upstream kinases such as Csk, by autophosphorylation, and through protein–protein interactions—allow tight spatial and temporal control over Fgr activity (ruzzene1994regulationofcfgr pages 4-6, abe2019gainoffunctionmutationsin pages 5-6)."
  },
  "FYN": {
    "uniprotid": "P06241",
    "gene_name": "FYN",
    "regulation": "Fyn activity is intricately regulated by multiple post-translational modifications and intermolecular interactions. Autoinhibition of Fyn is achieved through intramolecular interactions in which the SH2 domain binds to a phosphorylated tyrosine residue in the C-terminal tail, and the SH3 domain interacts with a proline-rich region in the linker domain; these interactions restrain the catalytic domain and maintain Fyn in a low activity state (register2014sh2catalyticdomainlinker pages 1-3, brignatz2009alternativesplicingmodulates pages 3-5). Activation of Fyn involves dephosphorylation of the inhibitory C-terminal tyrosine and subsequent phosphorylation of the activation loop tyrosine by autophosphorylation, which increases catalytic activity (demuro2022arn25068aversatile pages 1-3, weir2016novelautophosphorylationsites pages 1-3). Additional regulation is provided by alternative splicing that produces isoforms (Fyn1 and Fyn2) with different regulatory properties due to variations in their SH2–catalytic domain linker, thereby altering allosteric coupling and substrate binding potential (brignatz2009alternativesplicingmodulates pages 7-9, register2014sh2catalyticdomainlinker pages 3-4). Negative regulation is also exerted through protein–protein interactions; for instance, the c-Cbl proto-oncogene product binds to Fyn and promotes its ubiquitination and subsequent proteasomal degradation (andoniou2000thecblprotooncogene pages 1-2, andoniou2000thecblprotooncogene pages 15-16). Moreover, novel autophosphorylation sites within the SH2 domain, such as Tyr185, Tyr213, and Tyr214, modulate both kinase activity and the phosphotyrosine-binding capacity of the SH2 domain, thus impacting downstream signaling interactions (weir2016novelautophosphorylationsites pages 4-6, weir2016novelautophosphorylationsites pages 9-13). Fyn is further regulated by upstream kinases and phosphatases that modulate its phosphorylation status in response to extracellular signals; for example, C-terminal Src kinase (Csk) phosphorylates the inhibitory tyrosine, while protein kinase A (PKA) has been reported to activate Fyn indirectly by facilitating its association with focal adhesion kinase (PTK2/FAK1) (demuro2022arn25068aversatile pages 1-3, andoniou2000thecblprotooncogene pages 12-13)."
  },
  "SRC": {
    "uniprotid": "P12931",
    "gene_name": "SRC",
    "regulation": "Src activity is tightly controlled through multiple regulatory mechanisms. A principal mode of regulation is via phosphorylation at two key sites. Phosphorylation of the C-terminal Tyr527 by kinases such as Csk (and its homolog Chk) promotes an intramolecular interaction in which the SH2 domain binds the phosphotyrosine, thereby stabilizing Src in an inactive conformation. Conversely, autophosphorylation of Tyr416 in the activation loop shifts the equilibrium toward an open, active conformation. In addition to these phosphorylation events, the SH3 domain can bind proline-rich sequences in partner proteins, and such interactions can either facilitate or disrupt the intramolecular interactions that maintain the inactive state. These allosteric and conformational regulations ensure that Src is activated transiently in response to upstream receptor engagement, such as from immune response receptors, integrins, or receptor tyrosine kinases (ayrapetov2006structuralandfunctional pages 103-106, lin2005probingtheregulatory pages 139-141)."
  },
  "YES1": {
    "uniprotid": "P07947",
    "gene_name": "YES1",
    "regulation": "The activity of YES1 is governed by multiple regulatory mechanisms that include post-translational modifications and protein–protein interactions. A key event in the activation of YES1 is the autophosphorylation of a tyrosine residue located within its activation loop; this autophosphorylation induces a conformational shift that opens the catalytic cleft and enhances substrate access to the active site. In contrast, phosphorylation of a conserved tyrosine residue in the C-terminal tail—typically mediated by the C-terminal Src kinase (CSK)—results in an autoinhibited conformation. In this inhibited state, the SH2 domain binds intramolecularly to the phosphorylated tail, thereby occluding the active site and preventing substrate binding. In addition to phosphorylation, YES1 is subject to ubiquitination that can influence its protein stability and subcellular redistribution. Lipid modifications in the SH4 domain, specifically myristoylation and palmitoylation, also play essential roles in regulation by targeting YES1 to membrane microdomains where receptor tyrosine kinases (such as EGFR, PDGFR, CSF1R, and FGFR) reside. These membrane-localized interactions not only facilitate YES1 activation but also ensure that its catalytic activity is spatially coordinated with its downstream substrates (Kook2024EmergingRolesOf pages 13-14, Bhullar2018KinaseTargetedCancerTherapies pages 11-13)."
  },
  "BLK": {
    "uniprotid": "P51451",
    "gene_name": "BLK",
    "regulation": "BLK activity is subject to multiple layers of regulation that are common to Src family kinases. Post-translational modifications, notably phosphorylation at specific tyrosine residues within the activation loop (which, when phosphorylated, promote full kinase activity) and at a conserved C-terminal inhibitory tyrosine (which, when phosphorylated by Csk, stabilize an inactive conformation), are critical determinants of its functional state (barreiro2017functionalstudiesof pages 98-101, bolen1997leukocyteproteintyrosine pages 6-9). In addition, the Ala71Thr variant in the SH3 domain has been documented to enhance polyubiquitination of BLK, thereby decreasing its half-life and protein levels; this modification is mediated by E3 ubiquitin ligases such as E6AP following activation (barreiro2017functionalstudiesof pages 72-76). Such regulation via phosphorylation and ubiquitination ensures that BLK-mediated signaling is tightly controlled during B cell development and activation (korademirnics2000srckinasemediatedsignaling pages 9-10, mahajan1995srcfamilyprotein pages 6-7)."
  },
  "HCK": {
    "uniprotid": "P08631",
    "gene_name": "HCK",
    "regulation": "The regulatory mechanisms governing HCK activity involve multiple levels of control that include post-translational modifications and intramolecular domain interactions. HCK is subject to both activating and inhibitory phosphorylation events. Autophosphorylation within the activation loop (analogous to Tyr416 in c-Src) leads to a conformational rearrangement that stimulates catalytic activity, whereas phosphorylation of the C-terminal tyrosine (comparable to Tyr527 in c-Src) by regulatory kinases such as Csk results in a closed, inactive conformation by promoting intramolecular binding between the phosphorylated tail and the SH2 domain (ayrapetov2006structuralandfunctional pages 148-150, lin2005probingtheregulatory pages 34-37). In addition, allosteric regulation occurs through the displacement of the SH3 domain by competing ligands, as evidenced by engineered variants of HCK that incorporate insertions in the kinase domain to allow external modulation. For example, experiments using an engineered variant of HCK (HckFL-Bad) demonstrated that disrupting autoinhibitory domain interactions can robustly activate the kinase, an effect that was reversible upon treatment with a selective small molecule disruptor (A-1155463) (bienick2019engineeredcontrolover pages 68-73). These regulatory modifications are crucial for ensuring that HCK activity is tightly controlled in hematopoietic cells, thereby preventing aberrant signaling that could lead to oncogenic transformation (corwin2016decipheringhumancytoplasmic pages 152-155, lin2005probingtheregulatory pages 139-141)."
  },
  "LCK": {
    "uniprotid": "P06239",
    "gene_name": "LCK",
    "regulation": "Lck activity is tightly regulated by reversible phosphorylation events. Autophosphorylation at Y394 in the activation loop leads to kinase activation, whereas phosphorylation at Y505 creates an intramolecular association with its SH2 domain that results in an inactive conformation (majeti2000negativeregulationof pages 19-25, samraj2005rolefortyrosine pages 93-96). Regulation is further modulated by opposing enzymes: the kinase Csk phosphorylates Y505 which suppresses Lck activity, while the receptor-like phosphatase CD45 dephosphorylates Y505, thereby maintaining Lck in a “primed” state ready for activation upon TCR stimulation (majeti2000negativeregulationof pages 245-251, okada2012regulationofthe pages 1-3). Additional regulatory layers include reversible lipid modifications such as myristoylation and palmitoylation, which ensure proper plasma membrane localization and targeting to specialized microdomains (posevitz2007functionalelucidationof pages 43-46, korademirnics2000srckinasemediatedsignaling pages 1-2). The dynamic interplay among these post-translational modifications orchestrates the balance between Lck’s active and inactive forms, thereby controlling the threshold for T-cell activation (samraj2005rolefortyrosine pages 8-13, korademirnics2000srckinasemediatedsignaling pages 5-6)."
  },
  "LYN": {
    "uniprotid": "P07948",
    "gene_name": "LYN",
    "regulation": "Lyn is regulated by a multifaceted network of post-translational modifications, domain interactions, and lipid-mediated signals that together fine-tune its kinase activity. A principal regulatory mechanism involves phosphorylation events. Lyn is capable of autophosphorylation on a critical tyrosine residue located within its activation loop; this autophosphorylation event promotes a conformational shift toward an active state, thereby enhancing catalytic activity (donelladeana1998spontaneousautophosphorylationof pages 1-2). In contrast, phosphorylation of a conserved tyrosine residue in the C-terminal tail—typically mediated by the C-terminal Src kinase (CSK)—generates an autoinhibitory interaction through intramolecular engagement with the SH2 domain, resulting in suppression of kinase activity (donelladeana1998spontaneousautophosphorylationof pages 7-8, ingley2012functionsofthe pages 7-8).  \n\nBeyond these primary phosphorylation switches, additional regulatory layers contribute to Lyn’s control. Its SH3 and SH2 domains not only mediate interactions with target proteins but also participate in intramolecular contacts that stabilize the inactive conformation. These domains can bind to specific proline-rich or phosphotyrosine motifs, respectively, which either maintain the autoinhibited state or facilitate release upon appropriate stimulus. Moreover, Lyn undergoes lipid modifications – notably N-myristoylation – which is essential for membrane targeting and proper localization within distinct cellular compartments such as the plasma membrane or the Golgi apparatus. Recent studies have further identified that Lyn is subject to N-myristoylation-dependent phosphorylation at serine residues. For instance, phosphorylation at Ser-13 by casein kinase 1γ (CK1γ) has been documented to occur in a Golgi-dependent manner during intracellular trafficking; such modifications add an additional level of spatial and temporal regulation to Lyn’s activity (kinoshitakikuta2020proteinnmyristoylationdependentphosphorylationof pages 1-2, kinoshitakikuta2020proteinnmyristoylationdependentphosphorylationof pages 10-12). These regulatory events collectively ensure that Lyn activity is precisely controlled in response to extracellular signals and intracellular feedback, enabling it to switch between active and inactive states as required by the physiological context."
  },
  "ABL1": {
    "uniprotid": "P00519",
    "gene_name": "ABL1",
    "regulation": "The activity of ABL1 is tightly controlled by several layers of regulation. One major regulatory mechanism is autoinhibition, which is governed by intramolecular interactions involving the myristoyl group bound within a hydrophobic pocket of the kinase domain and the SH3 domain’s interaction with the SH2-kinase linker. This “latching” mechanism stabilizes an inactive conformation and prevents substrate access (hantschel2012structureregulationsignaling pages 1-2, wong2004thebcrablstory pages 10-12).  \nPhosphorylation plays a crucial role in ABL1 regulation. Autophosphorylation events, particularly at Tyr412 within the activation loop, serve as a molecular switch that shifts the enzyme from its inactive to active conformation. Phosphorylation at Tyr245 in the SH2-kinase linker also disrupts the inhibitory interactions maintained by the SH3 domain, thus promoting full kinase activation (hantschel2012structureregulationsignaling pages 3-4, roskoski2003sti571ananticancer pages 5-6).  \nIn addition to autophosphorylation, ABL1 is subject to other post-translational modifications. For instance, ubiquitination mediated by the CBL family of ubiquitin ligases can target ABL1 for proteasomal degradation, modulating its cellular abundance, especially in response to stress conditions (information section; rogers2021abelsonkinase’sintrinsically pages 26-26).  \nConformational dynamics further contribute to ABL1 regulation. The equilibrium between the inactive, autoinhibited state and the active, phosphorylated state is influenced by allosteric inhibitor binding. Inhibitors such as imatinib preferentially bind to the inactive DFG-out conformation of ABL1, thereby stabilizing the autoinhibited state, while other inhibitors such as dasatinib bind the active conformation (roskoski2003sti571ananticancer pages 8-9, tse2015moleculardeterminantsunderlying pages 35-36).  \nFinally, ABL1 shuttles between the cytoplasm and nucleus due to the presence of nuclear localization and export signals. In the nucleus, ABL1 participates in DNA damage responses and apoptosis, whereas in the cytoplasm it regulates cytoskeletal reorganization, cell adhesion and receptor endocytosis (hantschel2012structureregulationsignaling pages 8-9, rogers2021abelsonkinase’sintrinsically pages 1-2)."
  },
  "ABL2": {
    "uniprotid": "P42684",
    "gene_name": "ABL2",
    "regulation": "The activity of ABL2 is controlled by complex regulatory mechanisms that include intramolecular interactions, autophosphorylation events, and phosphorylation by upstream kinases such as Src. The autoinhibitory configuration is maintained via interactions between its SH3 domain and SH2–kinase linker, and these interactions can be disrupted by phosphorylation at key tyrosine residues such as those on the activation loop (e.g., analogous to Tyr412 in ABL1) and by phosphorylation events mediated by Src family kinases (hayes2013abelsonkinasebased pages 38-41, hantschel2012structureregulationsignaling pages 1-2). Post–translational modifications such as acetylation in the C-terminal region, ubiquitination leading to proteasomal degradation, and caspase cleavage further contribute to the regulation of ABL2 activity (hayes2013abelsonkinasebased pages 64-66, mayro2022thecharacterizationof pages 29-34). Additionally, ABL2 can undergo autophosphorylation, which not only enhances its catalytic activity but also serves as a mechanism for self-regulation through modification of its inhibitor-binding interfaces, as exemplified by its phosphorylation of ABI1, an established inhibitor (hayes2013abelsonkinasebased pages 38-41)."
  },
  "CSK": {
    "uniprotid": "P41240",
    "gene_name": "CSK",
    "regulation": "The enzymatic activity of CSK is meticulously controlled via several regulatory mechanisms that include subcellular localization, post‑translational modifications, and allosteric conformational dynamics.  \n\n • A primary regulatory mechanism for CSK is its subcellular localization. CSK is recruited to the plasma membrane through the binding of its SH2 domain to phosphotyrosine motifs on membrane-associated adaptor proteins such as Cbp/PAG. This spatial targeting is essential because the SFK substrates of CSK are membrane-bound; by localizing near these substrates, CSK can effectively exert its inhibitory phosphorylation function (fortner2022apoptosisregulationby pages 1-2, hunter2015theeukaryoticprotein pages 1-3).  \n\n • Post‑translational modifications also play a role in regulating CSK activity. For example, phosphorylation events mediated by cAMP‑dependent protein kinase (PKA) at residues including Ser364 have been reported. Although the full spectrum of biochemical effects stemming from these modifications is still under investigation, phosphorylation at Ser364 is believed to modulate CSK’s catalytic efficiency and substrate interactions by inducing subtle changes in its conformation (sun2023dissectionofthe pages 10-11, shah2018thesrcmodule pages 1-3).  \n\n • In addition to phosphorylation, conformational regulation of CSK is achieved through allosteric mechanisms that involve the interdomain communication between the SH3, SH2, and kinase domains. Binding events involving the SH2 domain, such as engagement with phosphotyrosine ligands on adaptor proteins, trigger structural rearrangements that can either enhance or limit catalytic activity. There is also evidence suggesting that redox-sensitive regulation—through transient disulfide bond formation between conserved cysteine residues—might contribute to conformational modulation, although this mechanism has been described only in the context of broader regulatory studies (sun2023dissectionofthe pages 9-9, shah2018thesrcmodule pages 1-3)."
  },
  "MATK": {
    "uniprotid": "P42679",
    "gene_name": "MATK",
    "regulation": "Regulatory mechanisms for MATK involve several layers of control. Post-translational modifications, particularly phosphorylation, play a central role in modulating its activity. MATK phosphorylates the C-terminal regulatory tyrosine on Src family kinases, thereby switching these kinases to an inactive conformation (chong2005cterminalsrckinase pages 1-2). In addition, MATK itself can be regulated via phosphorylation events mediated by upstream kinases such as protein kinase A (PKA), which phosphorylates residues (for example, Ser-364 in CSK, with similar mechanisms presumed for MATK) to stimulate full catalytic activity (ia2010structuralelementsand pages 21-25, chong2005cterminalsrckinase pages 6-8).  \nBeyond direct phosphorylation, MATK regulation also involves subcellular localization. Its SH2 domain directs MATK to plasma membrane microdomains by binding to phosphotyrosine residues on adaptor proteins such as Cbp/PAG. In hematopoietic cells and platelets, this localization is critical; for instance, upon thrombin stimulation in platelets, MATK translocates from the soluble cytosolic fraction to the cytoskeletal compartment, which correlates with a release of inhibition on Src family kinase Lyn (hirao1997translocationofthe pages 1-2, hirao1997translocationofthe pages 9-10).  \nFurthermore, MATK can inhibit Src family kinases not only by phosphorylating them but also through forming stable, non-catalytic complexes. This dual regulatory mechanism ensures efficient negative control over Src family kinase signaling, particularly in contexts where precise modulation of signal transduction is required (chong2005cterminalsrckinase pages 8-9)."
  },
  "MAPK1": {
    "uniprotid": "P28482",
    "gene_name": "MAPK1",
    "regulation": "ERK2 is regulated via multiple mechanisms. The primary mode of activation is through dual phosphorylation of the TEY motif located in the activation loop by MAP kinase kinases (MEK1 and MEK2). This phosphorylation event induces conformational rearrangements that realign catalytic residues and open the substrate binding cleft. In addition to activation, ERK2 is subject to deactivation by dual specificity phosphatases (MKPs) such as DUSP6, which dephosphorylate both the threonine and tyrosine residues, thereby attenuating its activity. Furthermore, regulatory proteins and scaffolds contribute to the spatial and temporal control of ERK2 signaling. For example, interactions with scaffold proteins help sequester ERK2 in specific subcellular compartments and modulate its access to both substrates and upstream kinases, while feedback phosphorylation events on upstream components also contribute to tightly regulated signal output (cargnello2011activationandfunction pages 2-4, busca2016erk1anderk2 pages 19-19, theodosiou2002mapkinasephosphatases pages 8-9)."
  },
  "MAPK3": {
    "uniprotid": "P27361",
    "gene_name": "MAPK3",
    "regulation": "The activity of MAPK3/ERK1 is tightly regulated by multiple mechanisms, ensuring that its kinase activity is coordinated precisely with cellular needs. A principal mode of regulation is through dual phosphorylation of its activation loop by the upstream dual-specificity kinases MEK1 and MEK2. Phosphorylation of both threonine and tyrosine residues in the TEY motif induces a conformational change that is necessary to achieve full catalytic activity (cargnello2011activationandfunction pages 2-4, kyriakis2012mammalianmapksignal pages 10-11). In addition, ERK1 is subject to regulation by a cohort of scaffold proteins which bind to specific docking domains on ERK1, bringing it into close proximity with its activators and substrates. These scaffolds, including proteins such as KSR and others, serve to compartmentalize the ERK module within subcellular locations and thereby increase the efficiency of signal transduction (lavoie2020erksignallinga pages 1-2, keshet2010themapkinase pages 1-4). Deactivation of ERK1 is mediated by dual specificity phosphatases (DUSPs), such as DUSP6, which remove the activating phosphate groups thereby returning ERK1 to an inactive state (theodosiou2002mapkinasephosphatases pages 4-5, raman2007differentialregulationand pages 1-2). Further regulatory inputs include transient interactions with additional protein kinases and phosphatases that fine-tune its activity, as well as potential feedback mechanisms that modulate the intensity and duration of the downstream signaling cascade (guo2020erkmapksignallingpathway pages 1-2, kirsch2021noncanonicalinteractionsof pages 94-97)."
  },
  "MAPK4": {
    "uniprotid": "P31152",
    "gene_name": "MAPK4",
    "regulation": "MAPK4 is regulated primarily by phosphorylation. Group I p21-activated kinases (PAK1/2/3) phosphorylate MAPK4 at Ser-186 within its activation loop; this modification is integral for achieving catalytic competence and stabilizing the interaction with substrate proteins such as MK5. Interaction with MK5 further promotes cytoplasmic accumulation, and studies show that genetic ablation of MAPK4 results in a significant reduction in MK5 activity. Additionally, reciprocal phosphorylation events have been observed, in which activated MK5 can, in turn, phosphorylate MAPK4. Despite these findings, the full extent of upstream activators, the involvement of additional post-translational modifications (such as ubiquitination), and the precise allosteric regulation of MAPK4 remain to be fully elucidated (almahi2013theregulationof pages 19-23, meloche2010inhibitionofcdk1cyclin pages 296-300, rousseau2009caractérisationdela pages 55-59)."
  },
  "MAPK6": {
    "uniprotid": "Q16659",
    "gene_name": "MAPK6",
    "regulation": "The regulation of MAPK6/ERK3 occurs primarily through non-canonical mechanisms that involve both phosphorylation and protein turnover. A critical regulatory event is the phosphorylation of the activation loop at serine 189, which can occur via autophosphorylation or through the action of group I p21-activated kinases (PAKs) (elkhadragy2024roleofthe pages 15-16). This phosphorylation event is essential for the subsequent formation of a signaling complex with MAPKAPK5 (MK5), whereby ERK3 and MK5 undergo reciprocal phosphorylation events that modulate their respective activities (elkhadragy2024roleofthe pages 2-4, seternes2004activationofmk5prak pages 11-12). In addition to phosphorylation, ERK3 regulation is also achieved at the level of protein stability using ubiquitin-proteasome pathways, although detailed ubiquitination mechanisms are more extensively described in other atypical MAPKs (schumacher2004scaffoldingbyerk3 pages 1-2, coulombe2007atypicalmitogenactivatedprotein pages 10-11). Nuclear export signals (NES) within its structure contribute to its dynamic nucleocytoplasmic shuttling and thereby influence its access to substrates (schumacher2004scaffoldingbyerk3 pages 1-2). These regulatory mechanisms ensure that the kinase activity of ERK3 is tightly moderated, allowing precise control over the phosphorylation events that influence various downstream signaling pathways (elkhadragy2024roleofthe pages 15-16)."
  },
  "MAPK7": {
    "uniprotid": "Q13164",
    "gene_name": "MAPK7",
    "regulation": "MAPK7 is activated by phosphorylation of its activation loop at the TEY motif by its specific upstream kinase, MAP2K5 (MEK5). This phosphorylation event induces conformational changes that relieve autoinhibition imparted by the C-terminal domain, thereby unmasking the nuclear localization signal and allowing translocation into the nucleus (lin2016erk5kinaseactivity pages 1-2, lochhead2020paradoxicalactivationof pages 1-2). Beyond this primary event, MAPK7 undergoes autophosphorylation on its C-terminal tail, which further enhances its transcriptional activity (cook2020smallmoleculeerk5 pages 14-15). Additional phosphorylation events at sites such as Thr732, among others, have been correlated with nuclear accumulation and modulation of transcriptional outputs (honda2015phosphorylationoferk5 pages 13-14). Regulation is also achieved through protein–protein interactions; for example, binding to chaperones such as HSP90/CDC37 in the inactive state maintains MAPK7 in a closed conformation until appropriate extracellular signals via receptor tyrosine kinases, including EGF receptors, trigger its activation through a Ras-independent, but MEK5-dependent pathway (cook2020smallmoleculeerk5 pages 15-16, paudel2021themek5erk5pathway pages 1-2)."
  },
  "MAPK15": {
    "uniprotid": "Q8TD08",
    "gene_name": "MAPK15",
    "regulation": "MAPK15 is regulated predominantly through autophosphorylation of its activation loop containing the Thr-Glu-Tyr motif, a process that appears to occur in a constitutive manner and is not strictly dependent on upstream MAPKKs (cargnello2011activationandfunction pages 6-8, thun2012theroleof pages 33-37). In addition to autophosphorylation, regulation of MAPK15 activity is modulated by protein turnover via the ubiquitin–proteasome pathway; its N-terminal region contains putative ubiquitination sites that target it for degradation, thereby influencing its cellular levels and activity (singh2018identificationandfunctional pages 4-5, dahm2025atypicalmapksin pages 7-8). The extended C-terminal domain also plays a role in subcellular localization by harboring a nuclear localization signal and multiple motifs required for protein–protein interactions, which collectively contribute to the enzyme’s spatial regulation within the cell (thun2012theroleofc pages 33-37, tillmann2015sec16asana pages 69-72)."
  },
  "MAPK8": {
    "uniprotid": "P45983",
    "gene_name": "MAPK8",
    "regulation": "MAPK8/JNK1 is regulated through a combination of phosphorylation events and protein–protein interactions. Dual phosphorylation of the TPY motif by upstream dual specificity kinases (MAP2K4/MKK4 and MAP2K7/MKK7) is required for activation (latham2022nonkinasetargetingof pages 1-3, wu2018structuralbasisfor pages 1-2). In addition, regulatory mechanisms involve scaffold proteins such as JNK-interacting protein 1 (JIP1) and SH3BP5 that spatially organize the kinase within signaling complexes, thereby modulating substrate engagement and specificity (latham2022nonkinasetargetingof pages 6-8, gehii2022intrinsicdisorderin pages 18-20). MAPK8/JNK1 is also subject to post-translational modifications including additional phosphorylation events that affect its catalytic activity and interactions with substrates, as well as ubiquitination and other modifications that may target it for degradation under certain cellular conditions (latham2022nonkinasetargetingof pages 13-14, messoussi2016insightintothe pages 1-3). Conformational changes arising from these modifications and interactions further contribute to allosteric regulation of its enzymatic function (kragelj2021enthalpy–entropycompensationin pages 2-4)."
  },
  "MAPK9": {
    "uniprotid": "P45984",
    "gene_name": "MAPK9",
    "regulation": "Regulation of MAPK9/JNK2 is complex and occurs at multiple levels. The primary activation mechanism is via dual phosphorylation of the TPY motif located in its activation loop. This phosphorylation is mediated by two MAP kinase kinases (MAP2Ks), MKK4 and MKK7, which are distinct in their substrate preferences: MKK4 preferentially phosphorylates the tyrosine residue, while MKK7 targets the threonine residue (barr2001thecjunnterminal pages 3-5, fleming2000synergisticactivationof pages 1-2, cargnello2011activationandfunction pages 5-6). Such coordinated phosphorylation events ensure a robust and synergistic activation of MAPK9/JNK2 in response to extracellular stress stimuli, including pro-inflammatory cytokines, ultraviolet irradiation, osmotic shock, and oxidative stress (barr2001thecjunnterminal pages 12-14, bogoyevitch2006usesforjnk pages 1-2).\n\nScaffold proteins play a pivotal role in regulating MAPK9/JNK2 by assembling signaling complexes that include upstream kinases, MAP2Ks, and the kinase itself. For example, the JNK-interacting protein-1 (JIP1) binds to JNK2 through a well-defined docking motif, thereby facilitating substrate recruitment, spatial organization, and even nuclear-cytoplasmic trafficking of the kinase (willoughby2003thejnkinteractingprotein1 pages 1-1, heo2004structuralbasisfor pages 1-2). Such scaffold-mediated assembly ensures precise signal propagation and prevents aberrant activation of MAPK9/JNK2 in non-stressed conditions.\n\nIn addition to phosphorylation by upstream kinases, MAPK9/JNK2 activity is modulated by dephosphorylation through dual-specificity phosphatases (DUSPs or MKPs) such as MKP1, MKP5, and others, which act as negative regulators to attenuate the signaling cascade (zeke2016jnksignalingregulation pages 31-32, zeke2016jnksignalingregulation pages 31-31). Feedback mechanisms are also operative; for instance, MAPK9/JNK2 may phosphorylate adapter proteins and even components of the upstream kinase complexes, thereby creating regulatory loops that fine-tune the overall kinase activity (barr2001thecjunnterminal pages 14-15, zeke2016jnksignalingregulation pages 16-17).\n\nPost-translational modifications beyond phosphorylation also contribute to the regulation of MAPK9/JNK2. Specific phosphorylation events on substrates and within the kinase itself determine its interactions with binding partners and its subcellular localization. Auto-phosphorylation of certain splice variants in vitro has also been observed, though its physiological relevance remains under investigation (zeke2016jnksignalingregulation pages 16-17, bogoyevitch2006usesforjnk pages 30-30). Overall, the regulation of MAPK9/JNK2 is multifaceted, involving precise kinase-phosphatase equilibria, scaffold-mediated assembly, and feedback loops that altogether ensure an appropriate cellular response to stress signals (barr2001thecjunnterminal pages 12-14, zeke2016jnksignalingregulation pages 1-2)."
  },
  "MAPK10": {
    "uniprotid": "P53779",
    "gene_name": "MAPK10",
    "regulation": "Regulation of MAPK10/JNK3 is achieved through a series of tightly controlled mechanisms that are responsive to extracellular stress signals. The principal regulatory event involves the dual phosphorylation of the activation loop at the TxY motif, an event carried out by the dual-specificity kinases MAP2K4 (MKK4) and MAP2K7 (MKK7). This modification induces conformational changes in JNK3 that convert it from an inactive to an active state, thereby unleashing its catalytic potential. In addition to the modification of the activation loop, MAPK10/JNK3 undergoes regulation via specific docking interactions. Many substrates of JNK3 contain defined D-sites, and these motifs facilitate the enzyme’s interaction with substrate proteins by targeting them to specific binding grooves on the kinase surface. Such docking interactions not only refine substrate specificity but also enhance the local concentration of substrates at the active site, increasing phosphorylation efficiency (ansideri2018multiplestrategiestargeting pages 38-42, whisenant2010computationalpredictionand pages 5-7, gordon2013combiningdockingsite pages 15-17).  \nFurthermore, in neuronal cells, the activity of MAPK10/JNK3 is modulated by scaffold proteins, including JNK-interacting protein 1 (JIP1) and β-arrestin2. These scaffold proteins assemble multiprotein complexes that serve to spatially restrict JNK3, dictate its subcellular localization, and coordinate the phosphorylation of specific downstream targets. Through such interactions, the cell is able to integrate extracellular signals such as pro-inflammatory cytokines and physical stress cues, ensuring that the resultant kinase activity is appropriately contextualized. Additional regulatory inputs may also involve protein–protein interactions that can either enhance or inhibit substrate phosphorylation. For example, the interaction with MEN1 has been shown to inhibit the phosphorylation of the transcription factor JUND by JNK3, thereby modulating downstream transcriptional responses (kyriakis2012mammalianmapksignal pages 9-10, musi2022colocalizationandinteraction pages 12-13)."
  },
  "RPS6KB1": {
    "uniprotid": "P23443",
    "gene_name": "RPS6KB1",
    "regulation": "Activation of RPS6KB1 is tightly regulated via multisite phosphorylation mechanisms that integrate signals from growth factors and nutrient availability. Under conditions of nutrient depletion, the kinase remains in an inactive state wherein it is sequestered by the EIF3 translation initiation complex. Upon mitogenic stimulation, mTORC1 becomes active and phosphorylates RPS6KB1 at its hydrophobic motif (Thr389 in S6K1), a modification that creates a docking site for PDK1. PDK1 subsequently phosphorylates the activation loop at Thr229, which is required for full kinase activation (hsu2011theidentificationof pages 71-75, majeed2019s6kinasea pages 17-20). Additional regulatory mechanisms involve feedback loops within the mTOR signaling network. Active RPS6KB1 phosphorylates components such as MAPKAP1/SIN1, mTOR, RICTOR, and DEPTOR, which in turn modulate mTORC2 and AKT1 activity through negative feedback regulation. Moreover, the kinase phosphorylates IRS1, leading to its ubiquitination and proteasomal degradation, a process that contributes to TNF-alpha-induced insulin resistance. Other post-translational modifications, including ubiquitination and acetylation, have been observed to affect the stability and activity of RPS6KB1, while phosphorylation of mitochondrial URI1 facilitates the release of the PPP1CC phosphatase that can dephosphorylate RPS6KB1 at Thr412, thus participating in an autoregulatory negative feedback loop (majeed2019s6kinasea pages 20-21, bdzhola2025coexpressionofthe pages 9-10, murphy2021theroleof pages 111-114, sridhar2022targetingrps6k1for pages 11-13, sridhar2022targetingrps6k1for pages 14-16)."
  },
  "EIF2AK4": {
    "uniprotid": "Q9P2K8",
    "gene_name": "EIF2AK4",
    "regulation": "The regulation of GCN2 activity is multifaceted and tightly linked to the cell’s metabolic state. Its primary mode of activation occurs in response to amino acid deprivation, when uncharged (deacylated) tRNAs accumulate in the cytoplasm. These uncharged tRNAs bind directly to the HisRS-like domain and the C-terminal dimerization domain, relieving an autoinhibited state and promoting kinase dimerization and autophosphorylation (altintas2024generalcontrolnonderepressible pages 1-2, zhao2023multiplerolesof pages 2-4).  \nAdditional regulatory mechanisms include its interaction with GCN1 and GCN20. GCN1 acts as a scaffold, recruiting GCN2 to ribosomes and facilitating the transfer of uncharged tRNAs from the ribosomal A-site to GCN2. This association is critical for full activation of the kinase under stress conditions such as both amino acid starvation and UV irradiation (tatara2024emergingroleof pages 4-5, donnelly2013theeif2αkinases pages 18-19).  \nPost-translational modifications also play an important role in modulating GCN2 activity. Autophosphorylation within the activation loop is essential for full catalytic activation, while additional phosphorylation events may fine-tune its activity or serve as feedback inhibition mechanisms. Other stress signals, such as glucose deprivation, oxidative stress, and ribosome stalling, can also indirectly modulate GCN2 via alterations in tRNA charging or alterations in GCN1/GCN20 interactions (anda2017activationofgcn2 pages 12-13, zhao2023multiplerolesof pages 4-6).  \nGCN2 is further regulated in concert with other nutrient-sensing pathways such as the mTOR pathway; under amino acid-rich conditions, mTORC1 activity helps maintain translation while inhibiting stress responses, thereby indirectly exerting negative regulation over GCN2’s activation (zhao2023multiplerolesof pages 9-11, altintas2024generalcontrolnonderepressible pages 8-8)."
  },
  "ATM": {
    "uniprotid": "Q13315",
    "gene_name": "ATM",
    "regulation": "ATM regulation is multifaceted and involves several layers of control. In response to DNA double-strand breaks, ATM is recruited to the sites of damage by the MRN complex (MRE11-RAD50-NBS1) and is activated by autophosphorylation events following conformational changes in its dimeric structure (shiloh2013theatmprotein pages 7-8, bhatti2011atmproteinkinase pages 9-10). Post-translational modifications are critical for the fine-tuning of ATM activity. Key modifications include autophosphorylation at Ser1981, which is required for dissociation of the inactive dimer to form the active monomer (shiloh2013theatmprotein pages 1-2, putti2021atmkinasedead pages 1-2). In addition, the acetylation of ATM by the Tip60 histone acetyltransferase, particularly at lysine residues such as K3016, is necessary for full activation (bhatti2011atmproteinkinase pages 16-18, shiloh2013theatmprotein pages 14-14). Other regulatory mechanisms involve phosphorylation-dependent interactions with downstream effectors (e.g., phosphorylation of p53, CHK2, and BRCA1) and the action of phosphatases such as PP2A and PP5, which serve to dephosphorylate and thereby inactivate ATM once the DNA damage response is resolved (oberle2010regulationofthe pages 3-4, shiloh2013theatmprotein pages 5-6). Furthermore, oxidative stress can independently activate ATM through disulfide bond formation involving specific cysteine residues, thereby linking ATM’s activity to the cellular redox state (bhatti2011atmproteinkinase pages 20-22, shiloh2013theatmprotein pages 6-7)."
  },
  "MTOR": {
    "uniprotid": "P42345",
    "gene_name": "MTOR",
    "regulation": "The regulatory mechanisms governing mTOR activity are both intricate and dynamic, ensuring that its kinase function is tightly controlled in response to a variety of cellular signals. Within the mTORC1 complex, the regulatory subunit RAPTOR acts as a scaffold to not only stabilize the complex but also facilitate the recruitment of both substrates and upstream activators. For instance, under nutrient-rich conditions, mTORC1 is localized to the lysosomal membrane where it becomes activated by RHEB GTPase. Active mTORC1 phosphorylates several downstream targets including EIF4EBP1 and RPS6KB1, which in turn enhance protein synthesis (alexander2015theconciseguide pages 1-2, rowland2010identificationoftheb pages 163-165).  \nNotably, mTORC1 phosphorylates ULK1 at Ser758 under nutrient sufficiency, which disrupts its interaction with AMPK and inhibits the initiation of autophagy. Additionally, mTORC1 mediates feedback inhibition on upstream growth factor signaling through the phosphorylation of GRB10, thereby modulating insulin receptor signals (panwar2023multifacetedroleof pages 1-2, shams2021evaluationofthe pages 13-14).  \nIn contrast, mTORC2, which is largely nutrient-insensitive, primarily responds to growth factor cues. Its regulatory subunits—most notably RICTOR and SIN1—determine substrate specificity for mTORC2. One of the critical functions of mTORC2 is the phosphorylation of AGC kinase family members such as AKT. Phosphorylation of AKT by mTORC2 at multiple residues (including Thr-450, Ser-473, Ser-477, and Thr-479) is essential for subsequent phosphorylation events by PDPK1/PDK1 and complete activation of AKT signaling (alexander2017theconciseguide pages 2-3, liu2012kinomewideselectivityprofiling pages 9-10).  \nFurthermore, mTOR can undergo autophosphorylation and interact with additional regulatory proteins via dynamic exchange of complex components, contributing to its context-dependent modulation. These multiple layers of regulation ensure that mTOR activity is finely adjusted in accordance with cellular nutrient status, energy levels, and extrinsic growth factor signals (alexander2015theconciseguide pages 1-2, panwar2023multifacetedroleof pages 1-2, shams2021evaluationofthe pages 13-14)."
  },
  "CDK1": {
    "uniprotid": "P06493",
    "gene_name": "CDK1",
    "regulation": "CDK1 activity is regulated by a complex network of mechanisms that include association with cyclin proteins, phosphorylation and dephosphorylation events, and interactions with inhibitory proteins. Activation of CDK1 generally requires binding to mitotic cyclins (most notably cyclin B) or, under certain circumstances, interphase cyclins; this association induces structural changes that reposition the T-loop, allowing substrate access. Full activation further depends on phosphorylation of a conserved threonine residue in the T-loop (analogous to Thr161 in CDK2), which is catalyzed by a CDK-activating kinase (typically CDK7 within the CAK complex). Conversely, CDK1 is negatively regulated through inhibitory phosphorylation at residues corresponding to Thr14 and Tyr15 by kinases such as WEE1 and MYT1; these phosphorylations keep the kinase inactive until they are removed by the CDC25 family of phosphatases. This precise regulation ensures that CDK1 activity is coordinated with cell cycle progression, particularly at the G2-M transition and during mitotic events such as centrosome separation, nuclear envelope breakdown, and chromosome condensation. In addition to post-translational modifications, the dynamic levels of cyclin binding partners and the action of specific CDK inhibitors further contribute to the tight regulation of CDK1 (wang2023targetingcdk1in pages 1-2, malumbres2005mammaliancyclindependentkinases pages 7-8, hanks1995theeukaryoticprotein pages 5-6)."
  },
  "CDK2": {
    "uniprotid": "P24941",
    "gene_name": "CDK2",
    "regulation": "The regulatory mechanisms governing CDK2 activity are multifaceted and depend primarily on cyclin association, phosphorylation events, and the binding of specific CDK inhibitors (CKIs). CDK2 requires association with cyclin E in early cell cycle phases and with cyclin A in later phases to achieve full activation; cyclin binding induces significant conformational changes that expose the active site for catalysis (equinet2004studiesonthe pages 51-55, pellarin2025cyclindependentproteinkinases pages 4-5). A critical regulatory step involves phosphorylation of threonine 160 in the activation loop by the CDK-activating kinase (CAK), a complex that comprises CDK7, cyclin H, and MAT1; this phosphorylation stabilizes the active conformation of CDK2 (pellarin2025cyclindependentproteinkinases pages 11-12, wood2018structuralinsightsinto pages 10-11). Conversely, inhibitory phosphorylation at residues such as threonine 14 and tyrosine 15 by Wee1 and Myt1 kinases suppresses CDK2 activity, and these inhibitory phosphates are removed by Cdc25 phosphatases to permit full activation (meschini2011purinebaseddualinhibitors pages 51-57, pellarin2025cyclindependentproteinkinases pages 19-20). In addition, binding of endogenous CDK inhibitors from the Cip/Kip family (e.g., p21^Cip1, p27^Kip1, and p57^Kip2) prevents substrate and ATP binding by stabilizing inactive conformations of the CDK2–cyclin complex (pellarin2025cyclindependentproteinkinases pages 7-8, meschini2011purinebaseddualinhibitors pages 35-41)."
  },
  "CDK3": {
    "uniprotid": "Q00526",
    "gene_name": "CDK3",
    "regulation": "The regulation of CDK3 activity is primarily mediated via its association with cyclin C, an interaction that facilitates the necessary conformational rearrangements for kinase activation. Phosphorylation of specific residues within the activation loop—typically performed by upstream CDK-activating kinases such as CDK7—further promotes full activation of CDK3. Functionally, the cyclin C/CDK3 complex is essential for the phosphorylation of substrates that drive the transition from the quiescent (G0) phase into the G1 phase of the cell cycle. In addition to cyclin binding and phosphorylation, CDK3 activity may be modulated by interactions with specific inhibitors and proteins that affect its stability and localization, although detailed regulatory mechanisms beyond cyclin association and activation phosphorylation have not been extensively characterized (peyressatre2015targetingcyclindependentkinases pages 32-34, chowdhury2023cmgckinasesin pages 4-6)."
  },
  "CDK4": {
    "uniprotid": "P11802",
    "gene_name": "CDK4",
    "regulation": "CDK4 regulation is achieved through multiple layers of control that include both post-translational modifications and protein–protein interactions. Phosphorylation of the T-loop residue, Thr172, is essential for catalytic activity, although in isolation this modification does not induce the fully active conformation commonly seen in other kinases (baker2022cdk4amaster pages 1-2, takaki2009thestructureof pages 3-3). Binding of D-type cyclins (D1, D2, or D3) is required to form the CDK4/cyclin complex, and this association is integral to both substrate recognition and activity regulation. Endogenous inhibitors such as the INK4 family proteins—most notably p16INK4A—bind to CDK4 and block its association with cyclin D, thereby inhibiting kinase activity by distorting the active site and preventing proper conformational rearrangements (bockstaele2006regulationofcdk4 pages 1-2, baker2012cdk4akey pages 2-3). In addition, members of the CIP/KIP family, such as p21CIP1 and p27KIP1, interact with already formed CDK-cyclin complexes, acting as modulators that can either inhibit or stabilize the enzyme depending on their phosphorylation state. The interplay between these inhibitors, cyclin binding, and T-loop phosphorylation establishes a finely tuned regulatory system, ensuring that CDK4 activity is tightly controlled during the G1 phase of the cell cycle (baker2022cdk4amaster pages 2-4, hallett2017structuralandfunctional pages 30-34)."
  },
  "CDK5": {
    "uniprotid": "Q00535",
    "gene_name": "CDK5",
    "regulation": "The regulatory mechanisms governing CDK5 activity are complex and involve multiple layers of post-translational modifications and protein–protein interactions. Notably, CDK5 is activated upon binding to its neuron-specific activators p35 and p39, which, unlike cyclins, confer spatial and temporal regulation of the kinase in postmitotic neurons (dhariwala2008anunusualmember pages 1-3, su2011cyclindependentkinasesin pages 1-3). A critical regulatory event is the proteolytic cleavage of p35 by the calcium-dependent protease calpain, which produces p25; this truncated fragment binds CDK5 with higher stability and leads to prolonged, hyperactive kinase activity that has been linked to pathological conditions such as Alzheimer’s disease (dhariwala2008anunusualmember pages 11-13, mapelli2005mechanismofcdk5p25 pages 8-9). CDK5 also undergoes autoregulatory phosphorylation events that modulate its substrate affinity and stability, with phosphorylation of p35 by CDK5 itself contributing to a negative feedback loop that regulates the turnover of the activator (dhariwala2008anunusualmember pages 13-15, su2011cyclindependentkinasesin pages 21-23). Additional layers of regulation include the modulation of CDK5 activity by several interacting proteins and substrates, such as p53, HDAC1, and members of the Rho and Ras family small GTPases, which further influence its kinase activity in stress responses and during neuronal development (cheung2012cdk5amultifaceted pages 4-6, peyressatre2015targetingcyclindependentkinases pages 15-17). Allosteric regulation through conformational changes upon binding of regulatory partners is central to controlling CDK5’s enzymatic activity and substrate specificity, making its regulation highly context-dependent (łukasik2021cyclindependentkinases(cdk) pages 23-25)."
  },
  "CDK6": {
    "uniprotid": "Q00534",
    "gene_name": "CDK6",
    "regulation": "The activity of CDK6 is tightly regulated by multiple mechanisms that ensure proper cell cycle progression and cellular differentiation. First, the binding of D-type cyclins is essential for CDK6 activation; these cyclins are induced by mitogenic signals and form holoenzyme complexes with CDK6 during the G1 phase (asghar2015thehistoryand pages 1-2, fassl2022cdk4andcdk6 pages 1-3). Additionally, the kinase is subject to activation loop phosphorylation by CDK-activating kinases (CAK), which further enhances its catalytic activity (malumbres2014cyclindependentkinases pages 5-6). CDK6 is negatively regulated by the binding of INK4 family inhibitors, such as p16^INK4A, which block cyclin association and induce conformational changes that inhibit ATP binding (sausville2002complexitiesinthe pages 1-2, sielecki2000cyclindependentkinaseinhibitors pages 5-6). Moreover, members of the Cip/Kip family—p21^Cip1 and p27^Kip1—can bind to preformed cyclin D–CDK6 complexes, affecting substrate recruitment and, in some instances, serving as both inhibitors and assembly factors depending on their phosphorylation state (fassl2022cdk4andcdk6 pages 3-4, peyressatre2015targetingcyclindependentkinases pages 27-30). These multiple layers of regulation ensure that CDK6 activity is coordinated with the cell’s proliferative status and differentiation cues (asghar2015thehistoryand pages 9-10, malumbres2011physiologicalrelevanceof pages 3-4)."
  },
  "CDK7": {
    "uniprotid": "P50613",
    "gene_name": "CDK7",
    "regulation": "CDK7 is regulated through multiple interrelated mechanisms that ensure its precise control during cell proliferation and transcription initiation. A primary mode of regulation is its assembly into the CAK complex, where binding to cyclin H and MAT1 is essential for the proper folding, activation, and substrate recognition of CDK7. The interaction with cyclin H induces conformational changes that not only bring catalytic residues into optimum alignment but also contribute to the opening of the active site. MAT1 further reinforces this activated conformation and may play a role in determining substrate specificity by influencing the overall structure of the complex.  \nPost-translational modifications are also critical in regulating CDK7 activity. Phosphorylation of the activation loop (T-loop) is necessary for the full activation of the enzyme, as this modification stabilizes the active conformation required for substrate binding and catalysis. Under conditions of DNA damage, CDK7 phosphorylates the tumor suppressor p53, which becomes activated and subsequently participates in a feedback loop by inhibiting CDK7 activity. This regulatory feedback mechanism is integral to the DNA damage response, resulting in cell cycle arrest or the initiation of apoptosis when genotoxic stress is detected. The combined effects of complex assembly and phosphorylation events ensure that CDK7 activity is maintained at a constant level throughout the cell cycle while being capable of rapid modulation in response to cellular stress signals (alexander2008rolesformotifs pages 90-94, alrawi2023cyclinaand pages 6-8, fisher2005secretsofa pages 4-5, fisher2017cdkregulationof pages 11-14)."
  },
  "CDK9": {
    "uniprotid": "P50750",
    "gene_name": "CDK9",
    "regulation": "The regulatory mechanisms that control CDK9 activity are multifaceted and include several levels of post-translational modifications as well as interactions with regulatory protein complexes. A critical regulatory step is the phosphorylation of the T-loop at Thr186, which is necessary for full kinase activation. This phosphorylation event stabilizes the enzyme’s active conformation and is essential for productive binding to cyclin T1; mutations in Thr186 result in severely compromised kinase activity (mandal2021targetingcdk9for pages 4-5, anshabo2021cdk9acomprehensive pages 4-6).  \nIn addition to T-loop phosphorylation, CDK9 function is modulated by its sequestration within the 7SK snRNP complex. In its inactive form, CDK9 is bound to 7SK small nuclear RNA and inhibitory proteins such as HEXIM1, which prevent premature or unscheduled phosphorylation activity. Release from this inhibitory complex is mediated by various cellular signals and post-translational modifications, thereby enabling CDK9 to join its cognate cyclin T1 in the formation of the active positive transcription elongation factor b (P-TEFb) complex (adderley2022comparativeanalysisof pages 7-9, brasier2008perspectiveexpandingrole pages 1-2). Other regulatory inputs include phosphorylation at additional sites within CDK9 (such as Ser175) that further modulate its interaction with substrates and regulatory partners, as well as acetylation events on cyclin T1 that affect the stability and release of P-TEFb from the 7SK complex (anshabo2021cdk9acomprehensive pages 9-11). The dynamic interplay of these modifications provides a complex network that finely tunes CDK9 activity in response to cellular conditions."
  },
  "CDK10": {
    "uniprotid": "Q15131",
    "gene_name": "CDK10",
    "regulation": "Regulation of CDK10 activity is multifaceted. A key regulatory mechanism is the phosphorylation of the activation loop at Thr196, a modification essential for catalytic activity without affecting cyclin binding; mutation of Thr196 eliminates kinase activity despite stable association with Cyclin Q (duster2022functionalcharacterizationof pages 2-3, duster2022functionalcharacterizationof pages 5-6). Additionally, CDK10 is phosphorylated at other residues such as Ser276, although the precise functional outcome of this modification remains to be fully elucidated. Beyond direct phosphorylation, CDK10 activity is controlled by its interaction with Cyclin Q, which not only stabilizes the kinase but also protects it from ubiquitin-mediated degradation (guen2017theawakeningof pages 3-4). In cellular contexts, regulatory cross-talk with other CDKs has been suggested by evidence indicating that CDK1 and CDK5 can phosphorylate CDK10 in vitro, implying an integration of CDK10 regulation within broader cell cycle and signaling networks (duster2022functionalcharacterizationof pages 5-6). Finally, the phosphorylation of its substrates—most notably ETS2—serves as an indirect regulatory mechanism, as CDK10-mediated phosphorylation triggers proteasomal degradation of ETS2, thereby modulating transcriptional outcomes (guen2017theawakeningof pages 10-12)."
  },
  "CDK14": {
    "uniprotid": "O94921",
    "gene_name": "CDK14",
    "regulation": "CDK14 regulation is mediated primarily through its interaction with cyclin Y, which is required for both activating the kinase and directing its subcellular localization to the plasma membrane. This interaction is facilitated by the unique PFTAIRE motif within CDK14 and the cyclin box domain of cyclin Y (alonso2021caracterizacióndecdk1418 pages 32-35, mikolcevic2012orphankinasesturn pages 1-2). Phosphorylation events play a significant role in regulating CDK14 activity; for example, phosphorylation of specific residues on cyclin Y, such as S71 and S73, has been linked to cyclin Y stability via a negative feedback loop (alonso2021caracterizacióndecdk1418 pages 32-35, ferguson2019discoveryofcovalent pages 13-14). Additionally, CDK14 itself can be phosphorylated, a modification that is typical for CDKs and is thought to contribute to the conformational adjustments necessary for catalytic activity. CDK14 also phosphorylates downstream targets, including LRP6 at Ser1490, which ties its activity to the regulation of the Wnt signaling cascade during critical cell cycle phases such as G2/M (alonso2021caracterizacióndecdk1418 pages 32-35, ferguson2019discoveryofcovalent pages 1-3). Other regulatory interactions, including potential engagement with 14-3-3 proteins, have been observed in studies of related kinases, although detailed mechanisms in CDK14 remain to be fully elucidated (alonso2021caracterizacióndecdk1418 pages 114-118, mikolcevic2012orphankinasesturn pages 2-3)."
  },
  "CDK15": {
    "uniprotid": "Q96Q40",
    "gene_name": "CDK15",
    "regulation": "Regulation of CDK15 appears to follow the general paradigm established for cyclin-dependent kinases. Its full activation is contingent upon binding to regulatory cyclins, with Cyclin Y being the most prominent candidate based on parallels with related kinases within the PFTAIRE subfamily. Cyclin binding induces conformational changes that facilitate the repositioning of the C-helix and activation loop into an active conformation, making the catalytic site competent for ATP binding and phosphoryl transfer. Moreover, CDK15 is subject to regulatory phosphorylation events; specific phosphorylation of residues within the activation loop is typically required to stabilize its active conformation, although the exact phospho-sites for CDK15 remain to be definitively characterized in the literature. Similar to other atypical CDKs such as CDK16, regulatory phosphorylation may also affect the interaction of CDK15 with 14-3-3 proteins, which in turn modulate its stability and subcellular distribution. Additionally, CDK15 has been implicated in antiapoptotic signaling pathways, whereby its phosphorylation of survivin on Thr-34 constitutes a regulatory mechanism to counteract TRAIL/TNFSF10-induced apoptosis (alonso2021caracterizacióndecdk1418 pages 29-32, chowdhury2023cmgckinasesin pages 21-22)."
  },
  "CDK17": {
    "uniprotid": "Q00537",
    "gene_name": "CDK17",
    "regulation": "Regulation of CDK17 activity involves mechanisms that are similar to those described for other members of the PCTAIRE subfamily. These regulatory mechanisms include activation through binding to cyclin partners, most notably cyclin Y and potentially other cyclin variants, as well as phosphorylation events at key residues within the activation loop. Phosphorylation by CDK-activating kinases (CAKs) is presumed necessary to induce conformational changes from an inactive to active state, although the precise cyclin partners and phosphorylation sites for CDK17 remain to be fully characterized (karimbayli2024insightsintothe pages 15-17, endicott2013structuralcharacterizationof pages 3-5). Additionally, CDK17 activity may be modulated by intracellular localization signals and binding of regulatory proteins, as observed in related PCTAIRE kinases (karimbayli2022dissectingtherole pages 68-71)."
  },
  "CDK18": {
    "uniprotid": "Q07002",
    "gene_name": "CDK18",
    "regulation": "The regulation of CDK18 occurs through multiple mechanisms that are characteristic of both classical and atypical cyclin-dependent kinases. One key regulatory mechanism involves binding to cyclins—most notably cyclin A2—and this interaction is critical for the activation of its kinase activity. In addition to cyclin binding, CDK18 is regulated by phosphorylation events; Protein Kinase A (PKA) has been shown to phosphorylate CDK18 at specific serine residues (for instance, a reported modification at Ser12) that enhance its activity, even in the absence of cyclin A2. Phosphorylation within the activation loop of the kinase domain is believed to be an important regulatory cue, although the precise sites and enzymes involved remain an area of active investigation.  \nFurthermore, CDK18 is subject to regulation via interactions with other regulatory proteins; for example, binding to members of the 14-3-3 family and ubiquitination machinery (such as the E3 ubiquitin ligase STUB1) may impact its subcellular localization and stability. These regulatory mechanisms enable tight temporal and spatial control of CDK18 activity, ensuring its involvement in replication stress signaling and neuronal function occurs in a regulated manner (barone2016humancdk18promotes pages 12-13, karimbayli2024insightsintothe pages 13-14, cole2009pctkproteinsthe pages 7-8, pepino2021overviewofpctk3cdk18 pages 1-2)."
  },
  "CDK20": {
    "uniprotid": "Q8IZL9",
    "gene_name": "CDK20",
    "regulation": "Regulatory mechanisms governing CDK20 activity encompass several layers. Post-translational modifications, particularly phosphorylation, play a key role; in the context of its functional relationship with CDK2, the phosphorylation status of its target threonine residue is crucial for activating downstream cell cycle events (tian2012cellcyclerelatedkinase pages 1-2, cheung2011ccrk(cellcycle pages 1-2). In addition, CDK20 expression and activity are influenced by alternative splicing, which produces distinct isoforms with differential abilities to activate CDK2 and participate in other regulatory pathways (lai2020theroleof pages 5-7, wohlbold2006thecyclindependentkinase pages 2-3). Epigenetic regulation has also been observed; hypermethylation at specific promoter CpG sites correlates with high CDK20 expression in certain tissues such as the adult brain cortex (cheung2011ccrk(cellcycle pages 1-2). Protein–protein interactions further regulate its activity, as CDK20 forms complexes with cyclin partners and other regulatory proteins that may influence its substrate specificity and catalytic efficiency. Despite initial hypotheses that CDK20 might exhibit intrinsic CDK-activating kinase (CAK) activity akin to CDK7, several reports establish that CDK20 lacks robust intrinsic CAK activity and may require interaction with additional co-regulators to achieve full catalytic function (wohlbold2006thecyclindependentkinase pages 1-2, tian2012cellcyclerelatedkinase pages 4-5)."
  },
  "FN3K": {
    "uniprotid": "Q9H479",
    "gene_name": "FN3K",
    "regulation": "Regulation of FN3K occurs primarily at the level of enzymatic activity rather than through extensive post-translational modifications typically seen in multisite-regulated kinases. Variability in FN3K activity has been observed among tissues and is correlated with intracellular glucose concentrations, as tissues with long-lived proteins (e.g., erythrocytes, lens, brain) exhibit higher activity to counteract glycation (avemaria2015possibleroleof pages 1-2, dacunha2006increasedproteinglycation pages 6-7). Additionally, genetic polymorphisms in the FN3K gene have been shown to influence enzyme activity and, consequently, site-specific protein glycation, as seen by differences in glycation levels of hemoglobin in normoglycemic subjects (delpierre2006variabilityinerythrocyte pages 1-2, conner2005somecluesas pages 8-13). Although detailed post-translational regulation mechanisms (such as phosphorylation or ubiquitination of FN3K itself) are not extensively characterized in the current literature, the enzyme’s activity appears to be modulated by substrate accessibility and possibly by changes in cellular redox conditions as indirectly implicated by studies examining protein repair functions (beisswenger2001humanfructosamine3kinasepurification pages 2-4, tsai2006anewinhibitor pages 1-2)."
  },
  "DCLK1": {
    "uniprotid": "O15075",
    "gene_name": "DCLK1",
    "regulation": "The regulatory mechanisms governing DCLK1 activity involve multiple layers of control that include intramolecular autophosphorylation, alternative splicing, and conformational dynamics. A principal mechanism is intramolecular autophosphorylation, wherein the kinase domain phosphorylates specific serine/threonine residues on DCLK1 itself. Autophosphorylation events, particularly within the C‐terminal tail, have been mapped using techniques such as Phos‐tag gel electrophoresis and mass spectrometry. These modifications can induce conformational changes that result in the docking of the C‐terminal tail against the catalytic core, effectively occluding the ATP‐binding site and functioning as an autoinhibitory signal (rogers2020autoregulatorycontrolof pages 1-3, rogers2020autoregulatorycontrolof pages 21-22, rogers2020autoregulatorycontrolof pages 22-29). Furthermore, increased phosphorylation within the DCX domains is associated with decreased microtubule binding, thereby modulating DCLK1’s interaction with the cytoskeleton (rogers2020autoregulatorycontrolof pages 3-5, rogers2020autoregulatorycontrolof pages 5-7).  \nAlternative splicing of the DCLK1 gene generates isoforms with differences in the number and arrangement of DCX domains, as well as variations in the length and composition of the regulatory C‐terminal region. These isoform‐specific variations have been shown to affect both the intrinsic kinase activity and the extent of C‐tail mediated autoinhibition, with kinetic analyses revealing changes in ATP affinity and catalytic turnover between isoforms (burgess2002alternativesplicevariants pages 1-2, rogers2021autoregulatorycontrolof pages 1-2, rogers2021autoregulatorycontrolof pages 11-12, rogers2021autoregulatorycontrolof pages 15-17, rogers2021autoregulatorycontrolof pages 2-4, rogers2021autoregulatorycontrolof pages 5-6, rogers2021autoregulatorycontrolof pages 9-11). These regulatory pathways ensure that DCLK1 activity is tightly controlled according to cellular context and developmental stage, balancing the requirements for microtubule stabilization with the need for dynamic phosphosignaling."
  },
  "DCLK2": {
    "uniprotid": "Q8N568",
    "gene_name": "DCLK2",
    "regulation": "DCLK2 is regulated at multiple levels. Alternative splicing generates different isoforms with distinct regulatory properties. For example, the DCLK2203 isoform, which predominates in clear cell renal cell carcinoma (ccRCC), lacks an auto-inhibitory C-terminal threonine residue that is present in other isoforms such as DCLK2201. This molecular difference results in markedly higher kinase activity for DCLK2203, as demonstrated by its ability to phosphorylate TBK1 efficiently (hu2024kinomewidesirnascreen pages 10-11). In addition, the catalytic activity of DCLK2 relies on an intact kinase domain, with point mutations (e.g., K423A) rendering the enzyme catalytically dead and unable to support oncogenic processes such as anchorage-independent growth or xenograft tumor formation (hu2024kinomewidesirnascreen pages 10-11). Regulation may also occur at the post-transcriptional level; for example, there is evidence suggesting that reduced expression of the nonsense-mediated mRNA decay (NMD) factor UPF1 in ccRCC can lead to increased expression of the hyperactive DCLK2203 isoform (hu2024kinomewidesirnascreen pages 10-11). While direct evidence of phosphorylation sites within DCLK2 (aside from its substrate TBK1 phosphorylation site) is not detailed in the available excerpts, autophosphorylation events and alternative splicing clearly contribute to its overall regulatory profile."
  },
  "BRSK1": {
    "uniprotid": "Q8TDC3",
    "gene_name": "BRSK1",
    "regulation": "BRSK1 is subject to multiple regulatory inputs that converge to control its kinase activity in a spatial and temporal manner. One principal mechanism involves phosphorylation by the upstream kinase LKB1. LKB1, which is constitutively active, phosphorylates a conserved threonine residue (Thr189 in BRSK1) in the activation loop, a modification that is essential for enzyme activation and subsequent substrate phosphorylation (bright2008investigatingtheregulation pages 1-2, 8-9).  \n\nIn addition to this phosphorylation event, BRSK1 is dynamically regulated by the cellular redox state. Several studies have demonstrated that reducing agents such as dithiothreitol (DTT) enhance BRSK1 kinase activity, whereas oxidizing conditions brought about by agents like hydrogen peroxide (H₂O₂) result in significant inhibition of its catalytic function. The underlying mechanism is based on the reversible oxidation of conserved cysteine residues within the kinase domain. These cysteines can form intramolecular disulfide bonds under oxidative conditions, which sterically hinder the proper arrangement of the catalytic segments and reduce enzyme activity; conversely, reduction of these disulfide bonds restores the active conformation of the kinase (bendzunas2025redoxregulationand pages 5-7, 7-9, 14-15).\n\nThis dual regulation—via phosphorylation on the T-loop and via cysteine oxidation—provides BRSK1 with a sensitive mechanism to integrate metabolic and redox signals in neuronal cells, thereby coordinating cellular responses to energy levels and oxidative stress without the need for additional upstream signals."
  },
  "BRSK2": {
    "uniprotid": "Q8IWQ3",
    "gene_name": "BRSK2",
    "regulation": "Activation of BRSK2 is primarily controlled by post-translational phosphorylation. The upstream kinase STK11 (also known as LKB1) phosphorylates BRSK2 at a conserved threonine residue in its activation loop (Thr-174), which is critical for relieving autoinhibition and activating the kinase (li2012apcccdh1targetsbrainspecific pages 5-8, thiriet2013cytoplasmicproteinserinethreonine pages 76-78). In addition to LKB1-mediated phosphorylation, BRSK2 is differentially phosphorylated at other residues with distinct functional outcomes; for instance, phosphorylation at Thr-174 has been shown to inhibit insulin secretion, whereas phosphorylation at Thr-260 promotes insulin secretion (information provided in the protein function description). Furthermore, BRSK2 is regulated via ubiquitination and subsequent proteasomal degradation mediated by the APC/C complex through recognition of a conserved KEN box motif, thereby modulating its stability during cell cycle progression (li2012apcccdh1targetsbrainspecific pages 3-4). Autoinhibition mediated by the UBA domain and the AIS within the KA1 domain contributes to conformational control, ensuring that kinase activity is tightly regulated until appropriate upstream signals relieve this inhibition (wu2015structuralinsightinto pages 6-7, tamir2020gainoffunctiongeneticscreen pages 3-5)."
  },
  "FAM20C": {
    "uniprotid": "Q8IXL6",
    "gene_name": "FAM20C",
    "regulation": "The regulation of FAM20C activity is mediated by several mechanisms that ensure precise control over extracellular protein phosphorylation. A key regulatory mechanism involves the formation of homo- or heterodimeric complexes. Fam20A, a closely related pseudokinase that lacks key catalytic residues, acts as an allosteric activator of FAM20C by forming a complex that enhances its kinase activity (cui2015asecretorykinase pages 11-13, cui2017structureoffam20a pages 15-16). This dimerization not only potentiates enzymatic activity but also contributes to the stabilization of FAM20C, including mutant forms that are associated with disease phenotypes.  \nIn addition to its regulation by Fam20A, FAM20C exhibits autophosphorylation events that may play a role in modulating its activity within the Golgi, as suggested by studies on its kinase parameters (ishikawa2012therainesyndrome pages 1-2). Under conditions of endoplasmic reticulum stress, FAM20C also phosphorylates specific ER-resident proteins such as P4HB/PDIA1; this post-translational modification induces a functional switch in P4HB from an oxidoreductase to a molecular chaperone and contributes to the overall maintenance of ER proteostasis (liu2023fam20cregulatesthe pages 19-20, cui2015asecretorykinase pages 1-2).  \nThe regulatory network further extends to the modulation of redox homeostasis via the phosphorylation of ERO1A, which enhances its oxidase activity and is required for oxidative protein folding. This phosphorylation event is crucial for maintaining the ER redox state under various stress conditions (fulcher2020functionsandregulation pages 14-15, xu2021fam20cinhuman pages 1-2)."
  },
  "PRKAA1": {
    "uniprotid": "Q13131",
    "gene_name": "PRKAA1",
    "regulation": "Regulation of AMPK alpha‑1 is achieved through multiple layers of control including allosteric activation, phosphorylation, and post‑translational modifications. A key regulatory mechanism is the phosphorylation of the activation loop threonine (Thr174 in AMPK‑α1), which is performed by upstream kinases such as LKB1, Ca²⁺/calmodulin-dependent protein kinase kinase‑β (CaMKKβ), and under certain conditions by TAK1 (arad2007ampactivatedproteinkinase pages 3-4, li2019ampkandautophagy pages 97-100, salt2017ampactivatedproteinkinase pages 1-2). Binding of AMP (and to a lesser extent ADP) to the gamma subunit allosterically promotes this phosphorylation and simultaneously protects the phosphorylated threonine from dephosphorylation by phosphatases, including PP2A and PP2C (hardie2011ampactivatedproteinkinase pages 2-3, russell2020ampactivatedproteinkinase pages 23-24). In addition to phosphorylation, AMPK alpha‑1 is subject to various post‑translational modifications that modulate its activity. These include ubiquitination events that can mark the protein for proteasomal degradation, as well as additional phosphorylation events within the serine/threonine‑rich (ST) loop that can negatively regulate activation by interfering with LKB1-mediated phosphorylation (ovens2021posttranslationalmodificationsof pages 5-6, ovens2021posttranslationalmodificationsof pages 12-14). The autoinhibitory domain (AID) of AMPK alpha‑1 also plays a significant role in maintaining the enzyme in an inactive conformation until appropriate allosteric signals relieve the inhibition (kurumbail2016structureandregulation pages 4-6, salt2017ampactivatedproteinkinase pages 2-3). This multi‑layered regulatory network ensures that AMPK is activated only under conditions of energetic stress, thereby coordinating downstream metabolic responses (tarasiuk2022ampkanddiseases pages 1-3, hardie2011ampactivatedproteinkinase pages 3-4)."
  },
  "MAPK11": {
    "uniprotid": "Q15759",
    "gene_name": "MAPK11",
    "regulation": "The regulatory mechanisms controlling MAPK11 activity center on its activation by upstream dual-specificity kinases, primarily MKK3 and MKK6, which phosphorylate the TGY motif within the activation loop. Dual phosphorylation at this motif is necessary to induce the conformational rearrangement that facilitates substrate binding and kinase activity. Inactivation is mediated by specific MAP kinase phosphatases (MKPs) that remove these phosphate groups, thereby returning MAPK11 to an inactive state. Additional layers of regulation include interactions with scaffold proteins and adaptor molecules that dictate subcellular localization and temporal activation, as well as allosteric regulation via inhibitor binding at the ATP site (cargnello2011activationandfunction pages 4-5, burton2021atypicalp38signaling pages 2-4, shi2002inthecellular pages 1-2)."
  },
  "MAPK12": {
    "uniprotid": "P53778",
    "gene_name": "MAPK12",
    "regulation": "MAPK12 is activated through a classical three-tier MAPK cascade wherein upstream dual-specificity MAPK kinases (MKKs), particularly MKK6 and, to a lesser extent, MKK3, catalyze the dual phosphorylation of its activation loop at the TGY motif (arbabi2002mitogenactivatedproteinkinases pages 1-2, cuenda1997activationofstressactivated pages 1-2). The phosphorylation event is catalyzed by MKK6, which is the principal upstream activator for all p38 MAPK isoforms, leading to a conformational change that stabilizes the active state of MAPK12 (cargnello2011activationandfunction pages 1-2, sugden1998“stressresponsive”mitogenactivatedproteinkinase pages 1-2). Post-translational modifications, notably phosphorylation, are the primary regulatory mechanism for MAPK12 activity and affect substrate access and catalytic efficiency (cuenda1997activationofstressactivated pages 10-11). In addition, certain cellular stress conditions such as osmotic shock promote a non-catalytic regulatory function of MAPK12; following osmotic stress, MAPK12 increases its association with the nuclear protein DLG1, thereby modulating DLG1-SFPQ complex dynamics in a manner that is independent of its kinase activity (arbabi2002mitogenactivatedproteinkinases pages 1-2). MAPK12 regulation also features involvement in checkpoint signaling, as it modulates signaling pathways involved in UV-induced DNA damage repair and G2 cell cycle arrest after gamma-radiation exposure (kyriakis2001mammalianmitogenactivatedprotein pages 4-6, tibbles1999thestressactivatedprotein pages 1-3). Moreover, MAPK12 influences the phosphorylation state of other transcription factors; for example, it has been shown to reduce c-Jun phosphorylation, thereby altering AP-1 complex regulation (kyriakis2001mammalianmitogenactivatedprotein pages 6-7). Alternative pathways, including association with specific scaffold proteins and phosphatases (such as MAPK phosphatases which dephosphorylate MAPKs), contribute to fine-tuning MAPK12 activity during dynamic cellular responses (cuenda1997activationofstressactivated pages 6-7, kyriakis2001mammalianmitogenactivatedprotein pages 13-15)."
  },
  "MAPK14": {
    "uniprotid": "Q16539",
    "gene_name": "MAPK14",
    "regulation": "MAPK14 is regulated primarily through dual phosphorylation on threonine-183 and tyrosine-185 within its activation loop, a process mediated by the upstream dual-specificity MAP kinase kinases MKK3 and MKK6, which respond to a variety of stress stimuli such as UV irradiation, oxidative stress, and inflammatory cytokines (cargnello2011activationandfunction pages 4-5, martinblanco2000p38mapksignalling pages 1-2). In addition to phosphorylation, MAPK14’s activity is modulated by its subcellular localization, with the kinase shuttling between the cytoplasm and the nucleus upon activation, thereby regulating both transcriptional and cytoplasmic substrates (cargnello2011activationandfunction pages 23-24, roux2004erkandp38 pages 17-18). Negative regulation of MAPK14 is provided by MAP kinase phosphatases (MKPs), which dephosphorylate the activation loop and attenuate the kinase signal, while interactions with other proteins, such as casein kinase II, further influence its autophosphorylation and subsequent activity (theodosiou2002mapkinasephosphatases pages 1-2, roux2004erkandp38 pages 17-18)."
  },
  "SGK1": {
    "uniprotid": "O00141",
    "gene_name": "SGK1",
    "regulation": "SGK1 is regulated both transcriptionally and post-translationally. Transcriptional regulation occurs under the influence of serum, glucocorticoids, mineralocorticoids, cytokines, and various stressors such as hyperosmotic shock, high extracellular glucose, and oxidative stress. Its promoter contains response elements for glucocorticoid and mineralocorticoid receptors, enabling rapid induction in response to hormonal stimuli (firestone2003stimulusdependentregulationof pages 11-11, daniels2010investigationofthe pages 194-196).\n\nPost-translationally, SGK1 activation is achieved through phosphorylation at multiple key residues. Phosphoinositide-dependent kinase-1 (PDK1) phosphorylates the activation loop (threonine 256), while mTOR complex 2 (mTORC2) phosphorylates the hydrophobic motif (serine 422) which is required for the proper alignment of the active site, thus enabling subsequent phosphorylation events (daniels2010investigationofthe pages 35-39, jang2022serumandglucocorticoidregulated pages 1-3). Additional phosphorylation sites have been identified (e.g., serine 78, threonine 369) that further modulate its activity through inputs from other pathways such as PKA and MAPK (firestone2003stimulusdependentregulationof pages 9-10, jang2022serumandglucocorticoidregulated pages 14-15). Moreover, SGK1 activity is intricately regulated by protein-protein interactions; binding to scaffold proteins such as NHERF2 helps localize SGK1 to the plasma membrane where it encounters its substrates. SGK1 also undergoes rapid ubiquitination via E3 ligases like Nedd4-2, which targets it for proteasomal degradation, thereby conferring a short half-life and dynamic control over its cellular levels (lou2016serumandglucocorticoid pages 14-15, maestro2020serumandglucocorticoidinduced pages 7-8)."
  }
}